[
    {
        "title": "Add query parameterization analysis"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "This allows you to analyze all queries issued during testing, and see which\r\nones were parameterized, which ones were not parameterized, and possible\r\nqueries where parameterization was missed.\r\n\r\nTo see this analysis, run \"rake check_query_parameterization\".  This will\r\nrun the specs logging all queries, then run a script that analyzes the\r\nlogged queries.  You can view the analysis in the created\r\nsql_query_parameterization_analysis.txt.\r\n\r\nThe first line in this analysis has summary data:\r\n\r\n```\r\nSummary: Missed: 11|11, Parameterized: 1034|71461, Not Parameterized: 94|33003\r\n```\r\n\r\n`Missed: 11|11` means 11 total and 11 unique queries were issued that you would\r\nexpect to be parameterized but were not (missed parameterization).\r\n\r\n`Parameterized: 1034|71461` means there were 71461 total and 1034 unique\r\nparameterized queries.\r\n\r\n`Not Parameterized: 94:33003` means there were 33003 total and 94 unique\r\nqueries that were not parameterized and not expected to be parameterized.\r\n\r\nThe rest of the file lists the unique queries for each of the three types.\r\nIt can be useful to review all sections to see the queries in use, in\r\ncase any appear odd and worthy of further review.\r\n\r\nIn order to get to the above results, this first adds a commit to make\r\nthe SQL generated by Sequel to not vary based on the number of elements\r\nin an array, by switching `column IN (value_list)` to\r\n`column = ANY(array_expr::type[])`."
    },
    {
        "author": {
            "login": "fdr"
        },
        "body": "People overuse the `.twice` or \"exactly n times\" feature, I harp on it but haven't really blocked commit for something like that.\r\n\r\nThere's only two useful modes in *almost* every circumstance. 100:1 or more: either `at_least(:once)` (ugh wordy, can we condense it with our own contraction?) or the default (which expects it exactly once). The \"n times\" is useful so rarely when it says something important about the algorithm.\r\n\r\nMaybe I need to be stricter about that. "
    }
]