[
    {
        "title": "Fix camera scaling issues on some phones."
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Some phones, notably the Pixel 3, had some problems with scaling after taking photos. This fixes it by \r\nusing the takePicture API instead of pulling the bitmap from the TextureView.\r\n\r\nAs a nice side-effect, Pixel 2/3 will give us back the visual-core-optimized images, so those phones will get nicer photos. And most phones in general will at least give back smoother/less noisy photos.\r\n\r\nFixes #8292\r\n\r\n**Test Devices**\r\n* [Google Pixel 3, Android 9.0, API 28](https://www.gsmarena.com/google_pixel_3-9256.php)\r\n* [Moto E (2nd Gen), Android 5.1, API 22](https://www.gsmarena.com/motorola_moto_e_(2nd_gen)-6986.php)\r\n* [Google Pixel, Android 9.0, API 28](https://www.gsmarena.com/google_pixel-8346.php)\r\n* [Google Pixel 2, Android 9.0, API 28](https://www.gsmarena.com/google_pixel_2-8733.php)\r\n* [Moto G4, Android 7.0, API 24](https://www.gsmarena.com/motorola_moto_g4-8103.php)\r\n* [Samsung Galaxy S9, Android 8.0, API 26](https://www.gsmarena.com/samsung_galaxy_s9-8966.php)\r\n\r\n"
    },
    {
        "author": {
            "login": "sirlada"
        },
        "body": "Unfortunately for me this seems not to be fixed. After taking a photo within the app the picture preview is zoomed in. I hope this is not intentional because as a result editing is only possible in the zoomed area and the picture cannot be viewed as a whole for checking it before sending. \r\n![screenshot_20181026-220414](https://user-images.githubusercontent.com/44510324/47590439-8ec87f80-d96c-11e8-9c08-02f8a4989115.png)\r\n![screenshot_20181026-220433](https://user-images.githubusercontent.com/44510324/47590440-8f611600-d96c-11e8-84c3-f5dbb9943fff.png)\r\n\r\ndevice: Nokia 6.1 TA-1043\r\nandroid: 8.1.0\r\nsignal: 4.29.7\r\n\r\nthx for looking into it!"
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Aspect ratio / cropping issues when taking a picture through the app",
                    "body": "- [x] I have searched open and closed issues for duplicates\r\n- [x] I am submitting a bug report for existing functionality that does not work as intended\r\n- [x] I have read https://github.com/signalapp/Signal-Android/wiki/Submitting-useful-bug-reports\r\n- [x] This isn't a feature request or a discussion topic\r\n\r\n----------------------------------------\r\n\r\n### Bug description\r\nWhen taking a picture using Signal's built-in camera feature the field of view is narrower than the phone's native camera app. In addition, once the picture is taken, the resulting image is further distorted along the x-axis (portrait orientation.)\r\n\r\n### Steps to reproduce\r\n- Open a conversation\r\n- Press the camera icon in the text input area\r\n- Press the button to take a picture\r\n\r\n**Actual result:** The viewfinder has a narrow field of view compared to the native camera app, and the captured image does not match what is shown in the viewfinder. This bug is present when using either the front camera or the rear camera.\r\n**Expected result:** The viewfinder shows the entire field of view available to the camera and the captured image matches what is shown in the viewfinder.\r\n\r\nIt's worth noting that the Pixel 3 has two front facing cameras, one of which has a wide angle lens.\r\n\r\n### Screenshots\r\nNone available\r\n\r\n### Device info\r\n**Device:** Google Pixel 3\r\n**Android version:** 9\r\n**Signal version:** 4.29.4\r\n\r\n### Link to debug log\r\nhttps://debuglogs.org/cce520452a627c33512db3672978ff0467442cb4a0b62d2df12fa75f84550814",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "greyson-signal"
                                },
                                "body": "I noticed this on my Pixel 3 as well.\r\n\r\nTo your first point, we basically center-crop the camera preview so it fills the entire screen. This means it will always be a subset of the camera's actual preview, but that's fine, it's intended.\r\n\r\nOf course the captured image being distorted is a bug. From the technical side, it's actually pretty annoying. `TextureView#getBitmap()` is inconsistent between devices as to whether it applies it's transformation to the bitmap, and there's no way to tell what it's doing. I thought it was simply an Android P vs non-Android-P thing, but it turns out it's more complicated than that. Honestly, there's no quick fix, and the actual solution will involve me re-writing the image capture in a more substantial way."
                            },
                            {
                                "author": {
                                    "login": "mathsen"
                                },
                                "body": "I have the same issue on the Huawei P20 Lite when taking a picture from inside the app just with the front camera. It was OK when introducing the new \"taking pictures\" features with the possibility to add text and notes to them but got disrupted during an update. I reported it via the the \"Google Beta program\" and got the response that the problem is being worked on but even in the latest beta version (Signal 4.30.7) it's still a problem.\r\nAndroid: 8.0.0.162 (C432)"
                            },
                            {
                                "author": {
                                    "login": "trugty"
                                },
                                "body": "I tentatively think this is fixed in version 4.43.2 on my Samsung S8"
                            },
                            {
                                "author": {
                                    "login": "pricead"
                                },
                                "body": "Seems to be fixed with that version on my Samsung Note8 as well. "
                            },
                            {
                                "author": {
                                    "login": "greyson-signal"
                                },
                                "body": "`\\(ˆ˚ˆ)/`"
                            },
                            {
                                "author": {
                                    "login": "dpthurst"
                                },
                                "body": "This is still happening to me (exactly as described in the report) on my Xperia XZ1 Compact."
                            },
                            {
                                "author": {
                                    "login": "qiaeru"
                                },
                                "body": "Still happening on OnePlus 6T. 😟"
                            },
                            {
                                "author": {
                                    "login": "SASniper"
                                },
                                "body": "This also is happening on my Galaxy S7 running android 8.0.0"
                            },
                            {
                                "author": {
                                    "login": "Antimon2000"
                                },
                                "body": "Still encountering the problem on my Samsung Galaxy S6.\r\n\r\nSignal App v5.3.12\r\nAndroid 7.0"
                            },
                            {
                                "author": {
                                    "login": "ablankenship10"
                                },
                                "body": "Also happening on Galaxy J7 Pro"
                            }
                        ]
                    }
                }
            }
        }
    }
]