[
    {
        "title": "Add the ability to block groups."
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Groups can now be blocked just like individual contacts. This will prevent the ability to be re-added to a group after you've left it.\r\n\r\nThis also fixes the situation where we block group-leave messages, preventing blocked contacts from leaving groups (Fixes #7970).\r\n\r\nAlso, this forced us to upgrade libsignal-service, which fixes the websocket timeout issues. Thanks to @dpapavas! (Fixes #6644)\r\n\r\n**Test Devices**\r\n* [Nexus 5X, Android 8.1, API 27](https://www.gsmarena.com/lg_nexus_5x-7556.php)"
    },
    {
        "author": {
            "login": "moxie0"
        },
        "body": ""
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Blocked users don't leave groups on the blocker's phone",
                    "body": "<!-- This is a bug report template. By following the instructions below and filling out the sections with your information, you will help the developers get all the necessary data to fix your issue.\r\nYou can also preview your report before submitting it. You may remove sections that aren't relevant to your particular case.\r\n\r\nBefore we begin, please note that this tracker is only for issues. It is not for questions, comments, or feature requests.\r\n\r\nIf you would like to discuss a new feature or submit suggestions, please visit the community forum:\r\nhttps://community.signalusers.org\r\n\r\nIf you are looking for support, please visit our support center:\r\nhttps://support.signal.org/\r\nor email support@signal.org\r\n\r\nLet's begin with a checklist: Replace the empty checkboxes [ ] below with checked ones [x] accordingly. -->\r\n\r\n- [x] I have searched open and closed issues for duplicates\r\n- [x] I am submitting a bug report for existing functionality that does not work as intended\r\n- [x] I have read https://github.com/signalapp/Signal-Android/wiki/Submitting-useful-bug-reports\r\n- [x] This isn't a feature request or a discussion topic\r\n\r\n----------------------------------------\r\n\r\n### Bug description\r\nIf a user is blocked, they cannot actually leave the group on the blocker's phone-- the message straight up doesn't make it through. Thus, the blocked user will continue to receive all messages from the blocker(s) within the group despite leaving.\r\n\r\n### Steps to reproduce\r\n- Add a user to a group\r\n- Block the user\r\n- Blocked user leaves the group\r\n- Send messages in the group\r\n\r\n### Steps to fix the issue on a per-group basis\r\n- Unblock the user\r\n- Add them to the group again\r\n- Have them leave again\r\n\r\n\r\n**Actual result:** Blocked user continues to receive messages despite being removed from the group; but only from the blocker(s)\r\n**Expected result:** Blocked user should not receive messages as they have left the group.\r\n\r\n### Screenshots\r\n<!-- you can drag and drop images below -->\r\n\r\nThis image is from the blocked device, as it is the affected device.\r\n![image](https://user-images.githubusercontent.com/13892402/42337274-1a883190-803b-11e8-8540-dfa491cb2c32.png)\r\n\r\n\r\n### Device info\r\n<!-- replace the examples with your info -->\r\nBlocker device:\r\n**Device:** Google Pixel 2 XL (taimen)\r\n**Android version:** 8.1.0\r\n**Signal version:** 4.22.4\r\nI have no info on the blocked device.\r\n\r\n### Link to debug log\r\n<!-- immediately after the bug has happened capture a debug log via Signal's advanced settings and paste the link below -->\r\nI doubt the logs will contain much of anything for this particular issue, but here you go.\r\n[Blocker device](https://debuglogs.org/0b4b3b83997b1f44819fad0215af966b55a14c9c856778b176b4ae379a111fd2)\r\nI have no info on the blocked device.",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "2-4601"
                                },
                                "body": "Related #3400"
                            },
                            {
                                "author": {
                                    "login": "Trolldemorted"
                                },
                                "body": "Also, if you are in a group with a blocked user and the blocked user adds a new nember, the views on the group are diverged: You and any member you add afterwards won't know about the new member, but the rest of the group does."
                            }
                        ]
                    }
                }
            }
        }
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Messages can take hours to be received",
                    "body": "### Bug description\r\nMessages can take hours to be received. Note that I don't have google services.\r\n\r\n### Steps to reproduce\r\n- Someone send me a message\r\n\r\n**Actual result:** \r\n- I receive it minutes or hours later\r\n\r\n**Expected result:** \r\n- I should receive it immediately\r\n\r\n### Device info\r\n**Device:** Motorola Razr i\r\n**Android version:** 4.4 (CM11)\r\n**Signal version:** 4.5.3\r\n\r\n### Link to debug log\r\nDon't have one now but can provide it if needed.\r\n\r\nThanks !",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "moxie0"
                                },
                                "body": "When you installed did it warn you about battery life and all that, or did you remove play services after already having Signal installed? Does the background service appear to be running?"
                            },
                            {
                                "author": {
                                    "login": "jeremy447"
                                },
                                "body": "It didn't warn of anything. I never had play services on my phone since I installed CM11.\r\nI have the notification (drop down info) that say the background connexion is active."
                            },
                            {
                                "author": {
                                    "login": "micressor"
                                },
                                "body": "@Paviluf I have something similar. Since one of our phones has 4.6.0 installed. The other phone is still on 4.5.3. As a workaround I had to disable/enable mobile data. After that, messages comes immediately. I see the drop down info, that signals background service is running.\r\n\r\n### Device info\r\n**Device**: Fairphone 2\r\n**Android version**: 5.1 (without play services)\r\n**Signal version**: 4.5.3 and 4.6.0"
                            },
                            {
                                "author": null,
                                "body": "I've been having a similar issue lately.  Granted my setup is a tad different.\r\n\r\n### Device Info\r\n\r\n**Device**: Nexus 5X\r\n**Android version**: 7.1.2 (CopperheadOS)\r\n**Signal version**: 4.5.3 (Noise)\r\n\r\nIf I open running services under developer options and kill all Signal(Noise) related services, then re-open the app, I receive all my missed notifications.  I'll try the disable/enable mobile data option next time it happens.  I have the app \"not optimized\" like it should be as well, because I do not have Google Play Services installed."
                            },
                            {
                                "author": {
                                    "login": "moxie0"
                                },
                                "body": "It sounds like your device is killing the process. Not sure if there's anything we can do beyond run a foreground service, this is really what GCM is for.\r\n\r\nIf you're running Noise, that's not our software. You'll have to contact the Noise developers for support."
                            },
                            {
                                "author": {
                                    "login": "micressor"
                                },
                                "body": "I sent a message on Monday at 18:42 which was successfully delivered. See checkmark on the right side. The last message on screenshot I received this morning (Wednesday) with the date of Monday morning 06:39.\r\n\r\n**Impact:** In my case, this happens 1 time every few days with a contact.\r\n**Expected result:** The last message should arrive no later than Monday 18:42.\r\n**Workaround:** Disable/Enable mobile data on both side.\r\n\r\nIn this scenario, I can not prove that the background service of Signal ran on the other side.\r\n\r\n![messages-can-take-hours-to-be-received-1](https://cloud.githubusercontent.com/assets/131317/26138792/ec72f76e-3acb-11e7-935a-0134753b672e.jpg)\r\n"
                            },
                            {
                                "author": null,
                                "body": "Also, I may be wrong, but for my situation, it seems to happen once a day around the time I switch from 4G to 3G due to the location of my work.  When sending a message I only receive one check (same if others send messages to me), until it finally completes sending which may take hours.   It's not exactly when I switch network type, but a little after.  Once again this could be completely unrelated as I haven't tested it much myself.  Just an observation.\r\n\r\n> If you're running Noise, that's not our software. You'll have to contact the Noise developers for support.\r\n\r\nAs a side note, Noise should simply be a re-branding of Signal with 100% the same code.  That's the impression I'm under."
                            },
                            {
                                "author": {
                                    "login": "moxie0"
                                },
                                "body": "@KehrBehr It is not. I would encourage you to install Signal if you want support here, otherwise please contact the Noise developers."
                            },
                            {
                                "author": {
                                    "login": "paride"
                                },
                                "body": "@moxie0 unless you know something that's not public, Noise is just Signal rebranded with `sed` and a few `s/Signal/Noise` lines:\r\n\r\nhttps://github.com/copperhead/Noise/blob/4.5.3/replace.sh\r\n\r\nIt exists only to avoid violating the trademark.\r\n\r\nThis is just for your information, in case you didn't know. I perfectly understand your point about not supporting unofficial products."
                            },
                            {
                                "author": {
                                    "login": "paride"
                                },
                                "body": "@moxie0 I'll just add that if you want to see Noise disappear you'll just have to explicitly allow the redistribution of the official Signal binary package, at least of the \"website\" flavor. I think @thestinger would be happy to stop building Noise and distribute that instead."
                            }
                        ]
                    }
                }
            }
        }
    }
]