[
    {
        "title": "Added new logger."
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "We have a problem where our debug logs don't go back very far. Right now, we rely on locally polling logcat. If we want to save more logs, we'll have to save them ourselves.\r\n\r\nTo do so, I've created a new logging layer called that mimics the interface of `Log`. You can add different `Loggers` to the new system. To start, I've added two Loggers: `AndroidLogger` and `PersistentLogger`. AndroidLogger just forwards everything to the standard Log command, while PersistentLogger persists logs on disk.\r\n\r\nPersistentLogger works as follows:\r\n- All work is done on a dedicated single-thread executor to prevent slowing down other parts of the app.\r\n- Logs are written to a file until it hits a certain line length, at which point that file will be closed and a new one is started.\r\n- When a new log is started, we'll delete any log file that is over a specified limit (e.g. right now we keep no more than 5 log files).\r\n- A new global UncaughtExceptionHandler has been added to log crashes.\r\n- Log files are stored in the cache directory in order to allow the system to clean them up as needed.\r\n- During log submission, we'll include both the logcat logs and these new logs until we can verify their stability, at which point we may be able to remove logcat logs.\r\n\r\nThis PR just introduces the logger and not any usages (to prevent diff noise).\r\n\r\n**Test Devices**\r\n- [Moto E (2nd Gen), Android 5.1, API 22](https://www.gsmarena.com/motorola_moto_e_(2nd_gen)-6986.php)\r\n- [Nexus 5X, Android 8.1, API 27](https://www.gsmarena.com/lg_nexus_5x-7556.php)"
    },
    {
        "author": {
            "login": "moxie0"
        },
        "body": ""
    },
    {
        "author": {
            "login": "greyson-signal"
        },
        "body": ""
    },
    {
        "author": {
            "login": "greyson-signal"
        },
        "body": ""
    },
    {
        "author": {
            "login": "greyson-signal"
        },
        "body": ""
    },
    {
        "author": {
            "login": "greyson-signal"
        },
        "body": ""
    },
    {
        "author": {
            "login": "moxie0"
        },
        "body": ""
    }
]