[
    {
        "title": "Android: Filter Device To Force High Frame Rate"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "In a device like mine (**Xiaomi**), applying force HFR is resulting in a drop fps.\r\nFiltering the device brand using `AndroidDeviceInfo.brand` helps to fix this bug.\r\n\r\n**Note: My current Display Frame Rate is set to 90Hz**\r\n\r\n| Before | After |\r\n| ------ | ------ |\r\n| <img src=\"https://github.com/KRTirtho/spotube/assets/89461185/6fc2b96f-826b-4a22-84eb-eb1572d57284\" width=60% height=60%> | <img src=\"https://github.com/KRTirtho/spotube/assets/89461185/50b953a1-6edb-4478-ab44-620e47f6df59\" width=60% height=60%> |"
    },
    {
        "author": {
            "login": "KRTirtho"
        },
        "body": "I'm not sure why but I also use a realme narzo 50. Which has 120hz refresh-rate and it's buttery smooth"
    },
    {
        "author": {
            "login": "KRTirtho"
        },
        "body": "Maybe instead of filtering devices, we let the user choose if they want this or not?"
    },
    {
        "author": {
            "login": "KRTirtho"
        },
        "body": "We can enable high refresh rate by default but we'll check if the current refresh rate is >=60 or not. If it's below 60 we'll ask the user to disable it with a dialog in the settings with toggle"
    },
    {
        "author": {
            "login": "brianabdl"
        },
        "body": "That's a good idea, although it's not every brand device that uses the buggy OS has this bug"
    },
    {
        "author": {
            "login": "brianabdl"
        },
        "body": "Or maybe, you could detect the after-changes fps with the target set fps, \r\nif after changing to target FPS, the current fps is lower than the target set fps, revert using the old fps"
    },
    {
        "author": {
            "login": "KRTirtho"
        },
        "body": "> Or maybe, you could detect the after-changes fps with the target set fps, if after changing to target FPS, the current fps is lower than the target set fps, revert using the old fps\r\n\r\nYeah, that is what I was [proposing at first](https://github.com/KRTirtho/spotube/pull/880#issuecomment-1814026234). But we'll let the user know and let them decide if they want to change or not."
    },
    {
        "author": {
            "login": "brianabdl"
        },
        "body": "Would the user get too many prompts at the first run (with the battery optimization warning)?\n\nI think it would be the best experience to do the failsafe method like you suggesting without giving them warning since many other apps out there don't do this warning just for the FPS thing"
    },
    {
        "author": {
            "login": "KRTirtho"
        },
        "body": "Hmm, that's also true. Yeah lets go that direction"
    },
    {
        "author": {
            "login": "brianabdl"
        },
        "body": "Hey, just wanna catch up, is there any improvement that I can make for this PR?\r\n\r\n"
    }
]