[
    {
        "title": "Allow only one instance of the gui"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": " - allow only one instance of the gui to be running \r\n - When in the background opening a new instance should pop up the current one , this should work nicely in places with out tray support. \r\n - fixes #7975 \r\n - fixes #5304 (as a tray icon is not really needed to get the running instance back now)\r\n\r\nTest Results: \r\n\r\n -  [x] Mac OS:\r\n    -  [X] macOS Restores when window is minimized\r\n    -  [X] macOS Restores when window is hidden\r\n    -  [X] macOS Restores when window was closed, Needs: https://github.com/deskflow/deskflow/pull/8034\r\n \r\n -  [X] Linux (Wayland):\r\n    -  [X] Wayland Restores when window is minimized\r\n        *Wayland doesn't allow for this on all De's the Icon flashes to request you look at the window instead\r\n    -  [X] Wayland Restores when window is hidden\r\n    -  [X] Wayland Restores when window was closed\r\n \r\n -  [X] Linux (X11):\r\n    -  [X] X11 Restores when window is minimized\r\n    -  [X] X11 Restores when window is hidden\r\n    -  [X] X11 Restores when window was closed\r\n\r\n  - [X] Windows:\r\n    -  [X] Windows Restores when window is minimized\r\n    -  [X] Windows Restores when window is hidden\r\n    -  [X] Windows Restores when window was closed\r\n"
    },
    {
        "author": {
            "login": "nbolton"
        },
        "body": "Could we use \"deskflow\" for the shared mem and socket name instead? \r\n- Adding \"GUI\" suggests there are other named shared memory which isn't the case\r\n- The name \"dfGui\" seems overly cryptic\r\n\r\nThe binary is also called `deskflow` so it'd be nice to match that."
    },
    {
        "author": {
            "login": "sithlord48"
        },
        "body": ""
    },
    {
        "author": {
            "login": "sithlord48"
        },
        "body": ""
    },
    {
        "author": {
            "login": "nbolton"
        },
        "body": ""
    },
    {
        "author": {
            "login": "nbolton"
        },
        "body": "Let's land #8034 first so I can test properly."
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Gnome StatusIcon API is becoming deprecated",
                    "body": "Hello,\n\nAs of [2014](https://bugzilla.gnome.org/show_bug.cgi?id=734826), the Gtk StatusIcon API has been deprecated and will soon stop being included in the desktop environment.\n\nI am currently running on elementary OS Loki (the current development version) and the team has decided to drop the StatusIcon already.  \n\nThis GNOME [document](https://wiki.gnome.org/Design/Whiteboards/StatusIcons) discusses possible migration paths for different purposes.\n\nWhen I brought up the issue with the elementary OS team. One of the suggestions was that synergy use a Switchboard plug (an entry in the elementary OS settings panel)\n\nIdeally, you would change your UI to be in accordance with the [GNOME guidelines](https://wiki.gnome.org/Design/Whiteboards/StatusIcons/Guidelines) or the [elementary OS guidelines](https://elementary.io/docs/human-interface-guidelines).\n\nI will be able to help with this issue in about a month time. If the decision is made to ignore it, I will fork synergy's UI.\n\nThere seems to be a pull request similar to this issue: https://github.com/symless/synergy/pull/4194\n",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "xhou-wavefin"
                                },
                                "body": "Do you mean remove tray icon and accord with GNOME guidelines?\n\n> I will be able to help with this issue in about a month time.\n\nPlease help us by create a pull request. We are using Qt for our GUI. If have anything related to compiling GUI, feel free to contact us.\n"
                            },
                            {
                                "author": {
                                    "login": "LeadManPL"
                                },
                                "body": "This bug has arrived to recently released Ubuntu 17.10, as ubuntu Team moved to Gnome 3.16, as they announced few months ago.\r\nAny chance you can fix this anytime soon? Having Synergy windows open all the time is kind of little PITA....\r\n\r\n@matzipan I suggest to add word \"Tray icon\" in bug title, as it took me some time to find that this bug was already reported, as most \"Mortals\" refer to this small icon, as \"Tray icon\""
                            },
                            {
                                "author": {
                                    "login": "kontsevoy"
                                },
                                "body": "As a workaround I stopped using Synergy GUI on a server and instead I configured this command to run automatically when my Gnome session starts:\r\n\r\n```\r\n$ /usr/bin/synergys -f --no-tray \\\r\n    --debug INFO \\\r\n    --name luna \\\r\n    -c /home/ekontsevoy/.synergy.conf \\\r\n    --address :24800 \r\n    --serial-key 724F7F3E12323.....12E\r\n```\r\n\r\nI imagine a similar command exists for a client as well."
                            },
                            {
                                "author": {
                                    "login": "rugk"
                                },
                                "body": "So you actually do not remove the track icon and having the window open all the time is also not required. The application can be closed, it runs in the background, but it's just not possible to see/reopen it via the tray icon.\r\n\r\nSo the solution GNOME advises is to use proper APIs and stuff for it. E.g. music players can use a direct API and have stuff in the notification, file sharing services can use libcloudproviders and have direct integration intro Nautilus.\r\n\r\nTheoretically, your place would possibly best in the settings for \"displays\" in GNOME. However, there you have to advocate to GNOME to add appropriate APIs.\r\n\r\nFYI, here are how other's solved this issue:\r\n* https://github.com/nextcloud/client_theming/issues/173\r\n* https://github.com/nitroshare/nitroshare-desktop/issues/204 (there are more links to resources in there)\r\n* https://github.com/telegramdesktop/tdesktop/issues/3830\r\n* …\r\n\r\nA good workaround for now is to use [the TopIcons Plus GNOME extension](https://extensions.gnome.org/extension/1031/topicons/) which brings back these icons for now."
                            },
                            {
                                "author": {
                                    "login": "Corben78"
                                },
                                "body": "Recently I upgraded my Ubuntu 16.04 LTS to 18.04 LTS and at first all system tray/status icons showed up. But then most of them disappeared. TopIcons Plus did help, but I has its own issues in combination with other gnome shell extensions. So I uninstalled it again. I got most icons back by uninstalling indicator-application and all the other unity indicators:\r\n```bash\r\nsudo apt purge indicator-application indicator-appmenu indicator-bluetooth indicator-common indicator-datetime indicator-keyboard indicator-messages indicator-power indicator-printers indicator-session indicator-sound\r\n```\r\nSome needed a `env XDG_CURRENT_DESKTOP=Unity` in the Exec-line of the .desktop file, like dropbox and discord.\r\n\r\nBut when starting synergy via autostart, I got this error message:\r\n```\r\nSystem tray unavailable. Don't close your window.\r\n```\r\nSynergy does work though, I just had no icon.\r\nWhen I started synergy manually, it worked without issues, no error message and I got a system tray icon. So I was wondering and found out, that if you delay the start of synergy a bit, it works.\r\nSo I added this line to my `~/.config/autostart/synergy.desktop` file:\r\n```\r\nX-GNOME-Autostart-Delay=5\r\n```\r\nAnd the issue is gone."
                            },
                            {
                                "author": {
                                    "login": "vincentmigot"
                                },
                                "body": "Hi,\r\nI had the same issue.\r\nA workaround for me on Debian Unstable with Gnome 3.34 was to install those extensions:\r\nhttps://extensions.gnome.org/extension/615/appindicator-support/\r\nhttps://extensions.gnome.org/extension/1031/topicons/\r\n\r\n![image](https://user-images.githubusercontent.com/42962790/67387603-84e55680-f597-11e9-8b46-6ed2b83b9012.png)\r\n"
                            },
                            {
                                "author": {
                                    "login": "nbolton"
                                },
                                "body": "This issue has been inactive for a while so I'll close it for now. \r\nPlease let me know if this is still an issue so that I can reopen it."
                            },
                            {
                                "author": {
                                    "login": "rugk"
                                },
                                "body": "Obviously it is. The deprecation does not go away, on the contrary, the workaround may cease to work and it will not be possible to use the app. "
                            },
                            {
                                "author": {
                                    "login": "nbolton"
                                },
                                "body": "Ah, my bad, sorry that wasn't very sensible of me!"
                            },
                            {
                                "author": {
                                    "login": "sithlord48"
                                },
                                "body": "Deskflow is not a GNOME app so we are not bound by the GNOME HIG.\r\n"
                            }
                        ]
                    }
                }
            }
        }
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Do not allow more then one instance of deskflow running at a time",
                    "body": "### Feature Request\n\nDeskflow currently allows any number of gui / server / clients to be run . \r\n\r\nIf gui / server or client is running prevent a new instance of the same from running at the same time \r\nRelated #7974 (more to add here as well)\r\n\r\n",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": []
                    }
                }
            }
        }
    }
]