[
    {
        "title": "Shortcuts for adding labels"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Closes #2087\r\n\r\nChanges proposed in this pull request:\r\n\r\n- new shortcut for the `my labels` menu added (default: `L`\r\n- opens the `my labels` list of the active article\r\n- `1` - `9` selects its item from the list\r\n- `0`: Cursor jumps into the input field\r\n\r\n(similar behavior as for the sharing menu. Sorry, only the first 9 items are available with 1 key press)\r\n\r\nHow to test the feature manually:\r\n\r\n1. open an article\r\n2. press `L`: it opens the `my labels` list\r\n3. press `0` - `9` to active its item\r\n\r\nPull request checklist:\r\n\r\n- [x] clear commit messages\r\n- [x] code manually tested"
    },
    {
        "author": {
            "login": "Frenzie"
        },
        "body": ""
    },
    {
        "author": {
            "login": "UserRoot-Luca"
        },
        "body": ""
    },
    {
        "author": {
            "login": "Alkarex"
        },
        "body": ""
    },
    {
        "author": {
            "login": "math-GH"
        },
        "body": ""
    },
    {
        "author": {
            "login": "Alkarex"
        },
        "body": "Detail about i18n: I know there are also some advantages, but I am not found of duplicating the strings.\r\n*'My labels'* has already been translated, so it is a pity to make a new, untranslated duplicate.\r\n\r\nhttps://github.com/FreshRSS/FreshRSS/blob/d1eb85e374c064146c0519d4bf6ca7e936a8014c/app/i18n/en/index.php#L93\r\n\r\nSo could the existing `index.menu.tags` be used instead of a new `conf.shortcut.mylabels` ?\r\n\r\n(P.S. It would be fine for me to rename `index.menu.tags` to `index.menu.user_labels` for improved clarity)\r\n"
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Add shortcut to add a label",
                    "body": "Now that we have this great feature, we should add a shortcut to quickly add an article to a label, in the same principle as that of sharing, with numbers. ",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "aledeg"
                                },
                                "body": "@Alwaysin I have no idea how this should work. Do you have some?"
                            },
                            {
                                "author": {
                                    "login": "Alwaysin"
                                },
                                "body": "When reading an article, you have a default shortcut 's' which opens the \"Share\" menu and you can then press 1 for example to automatically share with the first service configured.\r\n\r\nFor labels, there is no shortcut, we should first add one ('l' for 'label' or 't' for 'tag', I've seen both writings - maybe settle with only one name everywhere) and then add numbers so that when you press 2 it adds it to the label that is second in the list.\r\n\r\nEDIT: looks like you don't need to open the \"Share\" dropdown in the article view to then select the share, pressing the number will automatically do it even when not opened. So I don't know if we should change this behaviour or add diferent shortcuts than just numbers.\r\n\r\nEDIT2: I personally don't have that need anymore..."
                            },
                            {
                                "author": {
                                    "login": "aledeg"
                                },
                                "body": "@Alwaysin Thank you for your feedback. If you do not need it anymore, we can postpone it. Except of course if others need it as well.\r\nWhile waiting for other requests, I change the priority of this request.\r\nThank you."
                            },
                            {
                                "author": {
                                    "login": "sdenaro"
                                },
                                "body": "I would like this feature.  Same basic workflow, use a single key and then a number from the pop-up."
                            },
                            {
                                "author": {
                                    "login": "MichaelTunnell"
                                },
                                "body": "This is a critical thing for me. I currently use TT-RSS and whiles its a decent solution the main reason I use it is the quick labeling.\r\n\r\nThe filtering system of FreshRSS looks pretty dope! The one thing that holds me back is I like to organize by category and feed for incoming and I like to use labels to organize favorite articles that I save. I do [a podcast about Linux news](https://tuxdigital.com/podcasts/this-week-in-linux) and I have news types as labels such as \"distros\", \"desktops\", \"apps\", \"hardware\", \"mobile\", \"security\", etc. I like to use the labels to keep track of which articles are what type when I go to select articles to be featured in the show. The reason for this is a I filter articles throughout the week and need to go back to review at the end of the week.\r\n\r\nWithout the ability to quickly add a label, this process is **very** tedious because it would all be in the starred section solely.\r\n\r\nIn the current setup (based on demo), FreshRSS requires me to scroll all the way down to the bottom of an article, click on the labels button and then click on the related label. This just guarantees I would never use the labels function on FRSS, defeating the point of labels in my opinion.\r\n\r\nThe way TT-RSS does it is to have a right click menu that takes over the context menu and then you do multiple shortcuts to activate. For example, if I want to add the hardware label in TT-RSS I would right click on the article header, press A to add a label, then press D to choose desktops. If there are multiple D labels like desktops and distros, then it cycle through the list with repeated presses of D. Then it would apply the label upon pressing Enter.\r\n\r\nI am not saying this method is the best method but it is an option to consider. I'd also be okay with a single shortcut such as press L that all it did was activate the labels popup and then I select from there with a mouse. That's not ideal as keyboard only would be that, however, I would consider that totally acceptable because it adds a convenient way to use labels vs the current setup.\r\n\r\nTT-RSS also has auto-labeling so you can add a label based on search filters, this is very nice but I could live without that if I could quick add labels.\r\n\r\nThe filtering system of TT-RSS is alright but not super reliable and the search functionality of TT-RSS is mediocre at best.  FreshRSS filtering and search features are impressive! If FreshRSS had quick labeling then it would instantly become my solution."
                            },
                            {
                                "author": {
                                    "login": "RonnyB74"
                                },
                                "body": "I would really appreciate a keyboard shortcut for adding labels too!\r\n\r\nThanks, Ronny"
                            },
                            {
                                "author": {
                                    "login": "math-GH"
                                },
                                "body": "Tests are welcome in #7274"
                            },
                            {
                                "author": {
                                    "login": "Alwaysin"
                                },
                                "body": "Works fine, thank you!\nBut while the share menu seems to make the window move a bit further down so that we see every entry (at least the sole one I have), it would be good to be able to see all the entries on the labels menu too.\n\n![Image](https://github.com/user-attachments/assets/358004a4-576a-4557-b46e-f975e69c6718)"
                            }
                        ]
                    }
                }
            }
        }
    }
]