[
    {
        "title": "Fix the alignment and visibility issues when using the MiniMap widget with non-1.0 zoom values."
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "# Description\r\n\r\nThis PR fixes two issues I encountered while using the MiniMap widget with a zoom value other than 1.0:\r\n\r\nAlignment Issue: When zoom wasn't equal to 1.0, the minimap's center no longer aligned with the camera position, resulting in an off-centered display.\r\nVisibility Issue: When setting zoom to a value less than 1.0, the minimap area expanded as expected, but components (such as enemies) outside the camera view were not being displayed.\r\n\r\nTo address these issues, I made the following changes:\r\n\r\nReplaced widget.game.visibles() with widget.game.query() in the MiniMap widget. This allows the minimap to display all GameComponents, including those outside the camera view, ensuring everything is visible regardless of the zoom level.\r\nAdjusted the canvas.translate logic in the MiniMapCanvas class to keep the minimap centered on the cameraPosition, even with zoom adjustments. This helps maintain the alignment between the minimap and the camera position.\r\n\r\nThese changes should resolve the alignment and visibility issues when using the MiniMap widget with non-1.0 zoom values.\r\n\r\n## Checklist\r\n\r\nBefore you create this PR confirm that it meets all requirements listed below by checking the relevant checkboxes (`[x]`). This will ensure a smooth and quick review process.\r\n\r\n- [x] I open this PR to the `develop` branch.\r\n- [x] I have added a description of the change under `[next]` in `CHANGELOG.md`.\r\n- [x] I ran `dart format --output=none --set-exit-if-changed .` and has success.\r\n\r\n## Breaking Change\r\n\r\nDoes your PR require Flame users to manually update their apps to accommodate your change?\r\n\r\n- [ ] Yes, this is a breaking change (please indicate a breaking change in `CHANGELOG.md`).\r\n- [x] No, this is *not* a breaking change.\r\n"
    },
    {
        "author": {
            "login": "RafaelBarbosatec"
        },
        "body": "LGTM! Thanks for contributing!"
    }
]