[
    {
        "title": "[native] Wrap multistatement macros in a do-while loop"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "## Description\r\nUpdated the REPORT_IF_NOT_ZERO macro to wrap multistatement operations in a do { ... } while (0) construct. This change ensures proper scoping and avoids potential bugs when the macro is used in conditional statements without braces.\r\n\r\n## Motivation and Context\r\nThe previous implementation of the macro did not enforce scoping, which could lead to unintended behavior in specific contexts, such as when used in an if-else block without braces. By adhering to best practices recommended by CERT C's PRE10-C standard, this update improves code reliability and maintainability.\r\n## Impact\r\nThis change prevents subtle bugs and undefined behavior caused by improper scoping of multistatement macros. It aligns the code with industry best practices and coding standards, enhancing overall robustness without affecting functionality or performance.\r\n\r\n## Contributor checklist\r\n\r\n- [ ] Please make sure your submission complies with our [contributing guide](https://github.com/prestodb/presto/blob/master/CONTRIBUTING.md), in particular [code style](https://github.com/prestodb/presto/blob/master/CONTRIBUTING.md#code-style) and [commit standards](https://github.com/prestodb/presto/blob/master/CONTRIBUTING.md#commit-standards).\r\n- [ ] PR description addresses the issue accurately and concisely.  If the change is non-trivial, a GitHub Issue is referenced.\r\n- [ ] Documented new properties (with its default value), SQL syntax, functions, or other functionality.\r\n- [ ] If release notes are required, they follow the [release notes guidelines](https://github.com/prestodb/presto/wiki/Release-Notes-Guidelines).\r\n- [ ] Adequate tests were added if applicable.\r\n- [ ] CI passed.\r\n\r\n"
    },
    {
        "author": {
            "login": "jkhaliqi"
        },
        "body": "Could you run `make format-fix` to fix the failing format check"
    },
    {
        "author": {
            "login": "aditi-pandit"
        },
        "body": "Thanks @anandamideShakyan "
    },
    {
        "author": {
            "login": "aditi-pandit"
        },
        "body": "My bad... Slipped that the commits were merged. But don't think the revert is helpful now."
    },
    {
        "author": {
            "login": "aditi-pandit"
        },
        "body": "@anandamideShakyan, @jkhaliqi : Just fyi.... Its better to have fewer commits with contained changes. And follow the PR title conventions https://github.com/prestodb/presto/blob/master/CONTRIBUTING.md#commit-standards"
    }
]