[
    {
        "title": "Fixes #15038 -- Sorting options in party member list during use of transformation item."
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Fixes #15038\r\n\r\n### Changes\r\nFixes dropdown menu with sorting options on modal that appears when selecting a party member to use a transformation item.\r\nThe original sorting method returned the unmodified array. Changes it to return the sorted one.\r\nAlso copies the search function from the \"View Party\" modal so the search field works in the party member selection modal that appears when using a transformation item.\r\n"
    },
    {
        "author": {
            "login": "leonardochappuis"
        },
        "body": "I'm a first time contributor so the workflow for tests hasn't run automatically. Please may a mantainer start it? 👉👈"
    },
    {
        "author": {
            "login": "leonardochappuis"
        },
        "body": "Can someone pls review this"
    },
    {
        "author": {
            "login": "MohitBansal321"
        },
        "body": "@negue @CuriousMagpie I saw you have access to merge this PR kindly review and merge it\r\n"
    },
    {
        "author": {
            "login": "negue"
        },
        "body": "I'm on it to try it locally - but weird vue gives me some errors (in files you didn't change 😅 ) once that works I can get back to testing the PR ^^"
    },
    {
        "author": {
            "login": "leonardochappuis"
        },
        "body": "So, did yiu get a chance to try it?"
    },
    {
        "author": {
            "login": "negue"
        },
        "body": "Once I had it working again, other things took my time 😅, fast forward, tested it now - it works :)\r\n\r\nThank you for the first contribution :)\r\n\r\n@SabreCat LGTM"
    },
    {
        "author": {
            "login": "leonardochappuis"
        },
        "body": "No worries, thank you for reviewing this and for the welcome!"
    },
    {
        "author": {
            "login": "SabreCat"
        },
        "body": "@leonardochappuis Thanks for this! We'll get this live next deploy. Are you a user of Habitica? If so, let us know your @-username or user ID and we'll give you contributor credit there!"
    },
    {
        "author": {
            "login": "leonardochappuis"
        },
        "body": "> @leonardochappuis Thanks for this! We'll get this live next deploy. Are you a user of Habitica? If so, let us know your @-username or user ID and we'll give you contributor credit there!\n\nHey, no problem,\nI was looking forward to my first contribution so thank you for merging it!\nI actually didn't get much of a chance to use the app other than locally but my username is beuz."
    },
    {
        "author": {
            "login": "SabreCat"
        },
        "body": "All right! Well, if you should ever return, you've got your Blacksmith title now at tier 1!"
    }
]