[
    {
        "title": "Various fixes"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "## Points speed units\r\n\r\nDawarich expects speed to be sent in meters per second. It's already known that OwnTracks and GPSLogger (in some configurations) are sending speed in kilometers per hour.\r\n\r\nIn GPSLogger it's easily fixable: if you previously had `\"vel\": \"%SPD_KMH\"`, change it to `\"vel\": \"%SPD\"`, like it's described in the [docs](https://dawarich.app/docs/tutorials/track-your-location#gps-logger).\r\n\r\nIn OwnTracks it's a bit more complicated. You can't change the speed unit in the settings, so Dawarich will expect speed in kilometers per hour and will convert it to meters per second. Nothing is needed to be done from your side.\r\n\r\nNow, we need to fix existing points with speed in kilometers per hour. The following guide assumes that you have been tracking your location exclusively with speed in kilometers per hour. If you have been using both speed units (say, were tracking with OwnTracks in kilometers per hour and with GPSLogger in meters per second), you need to decide what to do with points that have speed in kilometers per hour, as there is no easy way to distinguish them from points with speed in meters per second.\r\n\r\nTo convert speed in kilometers per hour to meters per second in your points, follow these steps:\r\n\r\n1. Enter [Dawarich console](https://dawarich.app/docs/FAQ#how-to-enter-dawarich-console)\r\n2. Run `points = Point.where(import_id: nil).where(\"velocity != ? OR velocity != ?\", nil, \"0\")`. This will return all tracked (not imported) points.\r\n3. Run\r\n```ruby\r\npoints.update_all(\"velocity = CAST(ROUND(CAST((CAST(velocity AS FLOAT) * 1000 / 3600) AS NUMERIC), 1) AS TEXT)\")\r\n\r\n```\r\n\r\nThis will convert speed in kilometers per hour to meters per second and round it to 1 decimal place.\r\n\r\nIf you have been using both speed units, but you know the dates where you were tracking with speed in kilometers per hour, on the second step of the instruction above, you can add `where(\"timestamp BETWEEN ? AND ?\", \"2025-01-01\", \"2025-01-31\")` to the query to convert speed in kilometers per hour to meters per second only for a specific period of time. Resulting query will look like this:\r\n\r\n```ruby\r\npoints = Point.where(import_id: nil).where(\"velocity != ? OR velocity != ?\", nil, \"0\").where(\"timestamp BETWEEN ? AND ?\", \"2025-01-01\", \"2025-01-31\")\r\n```\r\n\r\nThis will select points tracked between January 1st and January 31st 2025. Then just use step 3 to convert speed in kilometers per hour to meters per second.\r\n\r\n### Changed\r\n\r\n- Speed for points, that are sent to Dawarich via `POST /api/v1/owntracks/points` endpoint, will now be converted to meters per second, if `topic` param is sent. The official GPSLogger instructions are assuming user won't be sending `topic` param, so this shouldn't affect you if you're using GPSLogger.\r\n\r\n### Fixed\r\n\r\n- After deleting one point from the map, other points can now be deleted as well. #723 #678\r\n- Fixed a bug where export file was not being deleted from the server after it was deleted. #808\r\n- After an area was drawn on the map, a popup is now being shown to allow user to provide a name and save the area. #740\r\n\r\n### Added\r\n\r\n- `X-Dawarich-Version` header to the `GET /api/v1/health` endpoint response. #800"
    },
    {
        "author": {
            "login": "gboudreau"
        },
        "body": ""
    },
    {
        "author": {
            "login": "Freika"
        },
        "body": ""
    }
]