[
    {
        "title": "Fix premature psiphon CONNECTED state"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "When using Psiphon mode, the local port (default 8086) is opened before psiphon is actually connected. This confuses OblivionVpnService into thinking the connection is made, publishing invalid CONNECTED state too early. This PR implements a method to wait for psiphon to completely connect, then publish CONNECTED state."
    },
    {
        "author": {
            "login": "markpash"
        },
        "body": ""
    },
    {
        "author": {
            "login": "markpash"
        },
        "body": "@ameerhossein Can you test the current `main` branch to see if you experience any issues? There are many complains that this feature is no longer working. Personally I'm also unable to connect when Psiphon mode is enabled."
    },
    {
        "author": {
            "login": "ameerhossein"
        },
        "body": "@markpash I tested the v1 release and it connects like usual. Actually I did not touch the way it tries to connect. I just modified the way it presents the connection state. So can you please try some steps to investigate the issue?\n\n![Screenshot_20240223_115843_Oblivion.jpg](https://github.com/bepass-org/oblivion/assets/75689502/25ced73f-cb35-4d54-b29e-386e4c7a4031)\n\n\n\n\nCan you confirm you reach this log on v1 logs and it still says CONNECTING?\n\n![IMG_20240223_120223_439.jpg](https://github.com/bepass-org/oblivion/assets/75689502/ecb1f2f2-b460-4633-8d3c-08f846c51a76)\n\nIf it reaches this log and still says CONNECTING, please try and check if you actually can access any website now or no? It might log psiphon started but if its connected without being able to access internet, its not really useful and it makes sense to not show the CONNECTED state.\n\nIf you can confirm it reaches the psiphon started log and its able to access the internet, then it's a problem caused by this PR and we need to investigate further.\n\nIf it does not reach the psiphon started log, please try the previous version. Was it reaching this log on old versions? Can you confirm it was not a false positive and is able to access the internet?\n\nBecause this PR eliminates false positives, We need to make sure previous CONNECTED states in old version were true and not just connected but unable to access the internet.\n\nThanks."
    },
    {
        "author": {
            "login": "markpash"
        },
        "body": "@ameerhossein I'm unable to test this at the moment. Maybe @DanielcoderX can help and try to recreate the issue and post the logs?\r\n"
    },
    {
        "author": {
            "login": "DanielcoderX"
        },
        "body": "Give me a minute "
    },
    {
        "author": {
            "login": "markpash"
        },
        "body": "I did a test in an android emulator in the (Android 14 image) and everything works perfectly. But on my personal phone running Android 13, the Psiphon mode doesn't work. This is just an anecdote. BTW I'm the UK so there's no filtering or strange networking happening."
    },
    {
        "author": {
            "login": "DanielcoderX"
        },
        "body": "@ameerhossein \r\nbased on some signs, I've found that the issue is related to the commits after **#57**  commit.\r\nThese commits look suspicious: 92a9c74 - a6a3311 - 6e6c129\r\nI'll be glad if you help and fix it."
    },
    {
        "author": {
            "login": "ameerhossein"
        },
        "body": "[92a9c74](https://github.com/bepass-org/oblivion/commit/92a9c745cb4924a771e4a06796c9273d66f06374) just decouples the same code from each activity so its effectively the same. \r\n\r\n[6e6c129](https://github.com/bepass-org/oblivion/commit/6e6c12953686010988522c567ecff5e9fe7a567f) just avoids multiple calls for the same state. This has nothing to do with state changes.\r\n\r\n[a6a3311](https://github.com/bepass-org/oblivion/commit/a6a3311b40f648ca9f3f5fc0199ddb6cbdb507e7) This could be the issue but I can't reproduce it. First I need to know the problem is occuring on which level. Is psiphon started but the state is not being updated? I need someone with this problem help me identify the cause. \r\n\r\n@DanielcoderX did you have this problem too? Did you check the logs?\r\n\r\nBtw we released v1 too early. Android apps need more testing due to their nature (strange behaviors across different OEMs)"
    },
    {
        "author": {
            "login": "DanielcoderX"
        },
        "body": "The problem is that the app works well on the emulator but not on a Real device, LOL\r\nyes I have the same. before version 1 it was ok.\r\nI've checked the logs and it sometimes shows that Psiphon is also connected.\r\nI think it's related to the _GO_ lib.\r\n\r\nyeah, that was too soon for releasing version 1 but unfortunately, users community was embarsed by the slow development due to political, social, and security reasons and we needed some sedative ASAP."
    },
    {
        "author": {
            "login": "markpash"
        },
        "body": "I just took a quick look at the code. Could [this](https://github.com/bepass-org/oblivion/commit/a6a3311b40f648ca9f3f5fc0199ddb6cbdb507e7#diff-ae98d30569ecf468ac5933391fd1992509f580a3fda077e6b1e86dbd1e6baafbR252) be the problem?\r\n\r\nI was playing with the app in an emulator with api version 31. I tried normal mode and psiphon and they worked fine. Then I tried gool and it didn't work until a couple of reconnects and waiting. Perhaps the bug exists for gool mode?"
    },
    {
        "author": {
            "login": "DanielcoderX"
        },
        "body": "> I just took a quick look at the code. Could [this](https://github.com/bepass-org/oblivion/commit/a6a3311b40f648ca9f3f5fc0199ddb6cbdb507e7#diff-ae98d30569ecf468ac5933391fd1992509f580a3fda077e6b1e86dbd1e6baafbR252) be the problem?\n> \n> I was playing with the app in an emulator with api version 31. I tried normal mode and psiphon and they worked fine. Then I tried gool and it didn't work until a couple of reconnects and waiting. Perhaps the bug exists for gool mode?\n\nIn the exact moment, I'm using Psiphon mode and it's working very well with high speed connection :/ everything works as expected.\nLooks like it's based on luckiness, LoL "
    },
    {
        "author": {
            "login": "ameerhossein"
        },
        "body": "> I just took a quick look at the code. Could [this](https://github.com/bepass-org/oblivion/commit/a6a3311b40f648ca9f3f5fc0199ddb6cbdb507e7#diff-ae98d30569ecf468ac5933391fd1992509f580a3fda077e6b1e86dbd1e6baafbR252) be the problem?\r\n\r\nThat just keeps pinging 1.1.1.1 until the first successful request which means you now have access to the internet. because you don't have access to internet while psiphon is trying to connect through warp. so just checking the local port is not enough to present the connected state. This behavior is for psiphon mode only so normal or gool mode is still the same as previous version.\r\n\r\n\r\n> I was playing with the app in an emulator with api version 31. I tried normal mode and psiphon and they worked fine. Then I tried gool and it didn't work until a couple of reconnects and waiting. Perhaps the bug exists for gool mode?\r\n\r\n I guess this has something to do with Cloudflare ip scanner of Go lib. You connect to warp through different IPs each time you try to connect. If you clear the endpoint option in settings, it shouldn't run the scanner so it worth trying it. It seems it only runs the IP scanner on each connection attempt if the value of that option equals \"engage.cloudflare.com:2408\"\r\n\r\nI don't think the problem is pinging. even if we don't ping to ensure connection, the connected state is just fake and you'd be unable to access the internet. I'm suspicious to the built-in IP scanner because @DanielcoderX says the behavior is random. That's the only thing that changes on every reconnect."
    },
    {
        "author": {
            "login": "ameerhossein"
        },
        "body": "> The problem is that the app works well on the emulator but not on a Real device, LOL\r\n\r\nAre they using the same network? I switched to Irancell and none of the methods connects. the normal mode says connected but it has no access to the internet (false-positive because the ping is only on psiphon mode.)\r\nPsiphon mode does not connect because it pings to check if there is proper internet connection access or no.\r\nAfter many tries it actually had access to the internet (both normal mode and psiphon) \r\nHowever everything works smoothly on the home network so I'm 80% sure there's a problem with IP scanning :thinking: "
    }
]