[
    {
        "title": "Fix some server/watch rebuild issues"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Two issues:\n\n1. Fixe potential edit-loop in server/watch mode (see below)\n2. Drain the cache eviction stack before we start calculating the change set. This should allow more fine grained rebuilds for bigger sites and/or in low memory situations.\n\nThe fix in 6c68142cc1338640e2bfe2add661a7b4d7bee6ab wasn't really fixing the complete problem.\n\nIn Hugo we have some steps that takes more time than others, one example being CSS building with TailwindCSS.\n\nThe symptom here is that sometimes when you:\n\n1. Edit content or templates that does not trigger a CSS rebuild => Snappy rebuild.\n2. Edit stylesheet or add a CSS class to template that triggers a CSS rebuild => relatively slow rebuild (expected)\n3. Then back to content editing or template edits that should not trigger a CSS rebuild => relatively slow rebuild (not expected)\n\nThis commit fixes this by pulling the dynacache GC step up and merge it with the cache buster step.\n\nFixes #13316\n"
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "One TailwindCSS related server rebuild issue",
                    "body": "I can reproduce this easily, so shoul be easy to fix. What happens in this TW4 site is:\n\n* Editing non TW related things (templates, content) => snappy refreshes.\n* Edit TW stylesheet => relatively slow rebuild (Tailwind)\n* Then editing non TW related things (templates, content) => seems to keep on rebuilding TW, which should not be needed.\n\nI'm not sure what's happening, or where, but this seem to be something new.",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "bep"
                                },
                                "body": "Reopen this, my fix for this didn't completely fix it, there still is an annoying issue with Tailwind rebuilds that should not be needed."
                            }
                        ]
                    }
                }
            }
        }
    }
]