[
    {
        "title": "For render hooks, only fallback to HTML (or the defaultOutputFormat) template"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Closes #13242\n"
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Lookup render hook templates by output format, falling back to HTML if present",
                    "body": "When you add the blockquote render hook \"render-blockquote.rss\" and don't provide \"render-blockquote.html\", HTML rendering changes: \"render-blockquote.rss\" replaces the default HTML blockquote rendering. I assumed it would only affect RSS and it messed up my site. IMO this is counterintuitive.\r\n\r\n### What version of Hugo are you using (`hugo version`)?\r\n\r\n<pre>\r\n$ hugo version\r\nhugo v0.140.2+extended+withdeploy darwin/arm64 BuildDate=2024-12-30T15:01:53Z VendorInfo=brew\r\n</pre>\r\n\r\n### Does this issue reproduce with the latest release?\r\n\r\nYes.",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "jmooring"
                                },
                                "body": "I've encountered this before, and had to create one for HTML and one for the other output format. This is true for all render hooks, and I understand why.\r\n\r\nToday, if you have three output formats and you want to modify the rendering of links (for example) for all output formats in the same way, you only need to create one render hook instead of creating three identical render hooks.\r\n\r\nMaybe we should treat HTML as Hugo's default output format[^1]. If there's not a hook targeting the current output format, use the HTML hook if present, else no hook at all. This would be a breaking change, but it wouldn't affect many (any?) users.\r\n\r\nIn the above, the \"HTML hook if present\" bit is also true when we're using default render hooks.\r\n\r\nOr we could fall back to something like render-link.default.irrelevant. But this would be a much larger breaking change.\r\n\r\n[^1]: This is a bit arbitrary but, from a practical standpoint, true. I guess we determine the \"default\" output format based on output format weight (i.e., the one with weight=0 is the default) but very few sites give weights to their output formats.\r\n"
                            },
                            {
                                "author": {
                                    "login": "github-actions"
                                },
                                "body": "This issue has been automatically locked since there has not been any recent activity after it was closed. Please open a new issue for related bugs."
                            }
                        ]
                    }
                }
            }
        }
    }
]