[
    {
        "title": "resources: Fix 2 image file cache key issues"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "- [x] Make the content hash key to be the base image (in a chain), which will be more effective, I think.\r\n\r\n* Always include the content hash in the cache key.\r\n* Always include the image config hash in the cache key.\r\n\r\nFixes #13273\r\nFixes #13272\r\n"
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Check images.Mask's cache key vs the mask supplied",
                    "body": "See https://github.com/gohugoio/hugo/issues/13272#issuecomment-2596092412",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "github-actions"
                                },
                                "body": "This issue has been automatically locked since there has not been any recent activity after it was closed. Please open a new issue for related bugs."
                            }
                        ]
                    }
                }
            }
        }
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Changed imaging config not reflected in the cache hash for some image filters",
                    "body": "I'm pretty sure this isn't true in general for the image resize methods etc., which is probably why I haven't seen this, but if you e.g. only apply `images.Mask` to an image, this becomes an issue.\n\nI just tried to change the `bgColor` in `hugo.toml` for http://localhost:1313/functions/images/mask/, but the change wasn't reflected until I cleared the image cache.",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "jmooring"
                                },
                                "body": "While updating the docs yesterday I tried a few different mask images... all with the same name (mask.png). I had to clear the image cache to see the changes. I was guessing that the hash did not include the mask content, just its original file name. But maybe there's something else going on."
                            },
                            {
                                "author": {
                                    "login": "bep"
                                },
                                "body": "> I was guessing that the hash did not include the mask content, just its original file name. But maybe there's something else going on.\n\nI'm taking this from memory, but for the resize ops (including `imaging.Process`) we add the global image config to the hash. I'm guessing this somehow got lost when we added other filters. For most of them this isn't an issue (they don't depend on global config), but `images.Mask` do (`bgColor`). Anyhow, i will have a look and fix this."
                            },
                            {
                                "author": {
                                    "login": "bep"
                                },
                                "body": ">While updating the docs yesterday I tried a few different mask images... all with the same name (mask.png). \n\nOK, I didn't read your post, but the above is a different issue; which looks like a bug with the `images.Mask` filter. I'll create a separate issue for this."
                            },
                            {
                                "author": {
                                    "login": "github-actions"
                                },
                                "body": "This issue has been automatically locked since there has not been any recent activity after it was closed. Please open a new issue for related bugs."
                            }
                        ]
                    }
                }
            }
        }
    }
]