[
    {
        "title": "feat: add option to not automatically plays tweener effect"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "# Pull Request Template\r\n\r\n## Description\r\n\r\nChange Summary:\r\nAdded a new option on the tweener effect called \"StartMode\" to set it to not automatically play on start. eg. you have an image with a UIEffect and UIEffectTweener and do not want the effect to play instantly when the object starts but still want to use Normal/Unscaled update mode to not have to tween values manually in code.\r\n\r\nContext/Motivation:\r\nI was having an issue where I was using a UIEffect component together with UIEffectTweener and it was tweening my values automatically on start. Since I still wanted to use Normal/Unscaled update mode and did not want to always enable/disable the component I created a new option called **StartMode** where you can set it to **manual** and the script will wait until you first call Play() on UIEffectTweener to start modifying the values, also you can keep it on **automatic** and use the default behavior.\r\n\r\n## Type of change\r\n\r\n- [ ] Bug fix (non-breaking change which fixes an issue)  \r\n- [x] New feature (non-breaking change which adds functionality)  \r\n- [ ] Breaking change (fix or feature that would cause existing functionality to not work as expected)\r\n- [ ] Update documentations\r\n- [ ] Others (refactoring, style changes, etc.)\r\n\r\n## Test environment\r\n\r\n- Platform: Windows\r\n- Unity version: 2020.3.48f1 / Unity 6000.0.28f1\r\n- Build options: Mono, URP\r\n\r\n## Checklist\r\n\r\n- [x] This pull request is for merging into the `develop` branch\r\n- [x] My code follows the style guidelines of this project\r\n- [x] I have performed a self-review of my own code\r\n- [x] I have commented my code, particularly in hard-to-understand areas\r\n- [x] I have made corresponding changes to the documentation\r\n- [x] My changes generate no new warnings\r\n- [x] I have checked my code and corrected any misspellings"
    },
    {
        "author": {
            "login": "mob-sakai"
        },
        "body": "Thank you for the pull request!  \r\nAh, that makes perfect sense. 👍 "
    },
    {
        "author": {
            "login": "vgArchives"
        },
        "body": "> Thank you for the pull request! Ah, that makes perfect sense. 👍\r\n\r\nThx! I'm glad to help."
    }
]