[
    {
        "title": "Refine map generator spawn placement rules"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Spawn generation generally tries to place spawns:\r\n\r\n- In spacious areas\r\n- Away from the center (true center or mirror lines)\r\n- Away from a symmetry-projected spawn\r\n- Away from previously placed spawns\r\n\r\nThis commit introduces the following adjustments:\r\n\r\n- The spacing between sequentially placed spawns is relaxed.\r\n- Fix spawn mines contributing too much to the space reservation.\r\n- Factor rotations into anti-center biasing calculation.\r\n- Preserve spacing information in center space fallback decisions.\r\n- Use a linear (instead of binary) falloff for anti-center biasing.\r\n- Enforce that spawns have a minimum buildable area around them.\r\n- Enforce that symmetry-projected spawns have as much separation as\r\n  sequentially placed spawns would.\r\n- Allow spawns on or near roads.\r\n\r\n(Addresses comments in https://github.com/OpenRA/OpenRA/pull/21717#pullrequestreview-2575279749 that aren't particularly related to that patch.)"
    },
    {
        "author": {
            "login": "PunkPun"
        },
        "body": "there seems to be a regression\r\n\r\nbefore\r\n\r\n<img width=\"378\" alt=\"Screenshot 2025-01-28 at 11 41 13\" src=\"https://github.com/user-attachments/assets/31aac41b-b301-4a25-b319-fdaf30342019\" />\r\n\r\nafter\r\n\r\n<img width=\"533\" alt=\"Screenshot 2025-01-28 at 11 41 22\" src=\"https://github.com/user-attachments/assets/59d8e002-07f6-42e0-ae28-9c0392837538\" />\r\n\r\nMap: Imminent Destruction\r\nSeed: -2106018462\r\nType: Mountain lakes\r\nRotations: 1\r\nMirror: top left vs bottom right\r\nPlayers per side: 10\r\n\r\nThere's more of this happening on the map, on all spawns next to water\r\n\r\nOceanic always does this (also see how half of the spawns are unplayable)\r\n\r\n<img width=\"952\" alt=\"Screenshot 2025-01-28 at 11 47 44\" src=\"https://github.com/user-attachments/assets/1189a432-9bf6-4caf-a341-3957842ad05f\" />\r\n\r\nspawns can still be unplayable, although that's much rarer\r\n\r\n<img width=\"312\" alt=\"Screenshot 2025-01-28 at 11 39 12\" src=\"https://github.com/user-attachments/assets/5cb09779-95f6-4918-8245-92de33e7a078\" />\r\n\r\n"
    },
    {
        "author": {
            "login": "PunkPun"
        },
        "body": "this still doesn't feel like it should be a legal place to put a spawn in\r\n\r\n<img width=\"244\" alt=\"Screenshot 2025-01-29 at 13 33 02\" src=\"https://github.com/user-attachments/assets/22ba3950-7e95-46c9-be96-a3f025e6b03f\" />"
    },
    {
        "author": {
            "login": "PunkPun"
        },
        "body": "7x7 is not enough to be playable, you need at liest 9x9 cells horizontally so you could deploy your mcv and place a refinery\r\n\r\nso let's say you either need 5 cells horizontally away from the center (inclusive) or you need 6 cells above the spawn or 7 cells bellow. The mcv is 3x4 as is the refinery\r\n\r\nThe 9x9 does give 5 cells horizontally on both sides\r\n\r\nWhen there's not enough room for spawns, maybe it would make sense to start removing features to make space?"
    },
    {
        "author": {
            "login": "PunkPun"
        },
        "body": ""
    },
    {
        "author": {
            "login": "PunkPun"
        },
        "body": "If we plan on adding auto-map generation to skirmish lobby, then such maps should fail generation"
    },
    {
        "author": {
            "login": "ashleynewson"
        },
        "body": "Seems that the ore rings are actually a regression of #21718, so I'll track there."
    },
    {
        "author": {
            "login": "pchote"
        },
        "body": "IMO there should be a check to ensure that all cells within some radius (5? cells) of the spawn must be be buildable for it to be valid."
    },
    {
        "author": {
            "login": "ashleynewson"
        },
        "body": "I've made some further improvements based on the review feedback.\r\n\r\nFor most terrain presets, I've gone with a minimum 9x9 (square) buildable area for spawns. This is relaxed to 7x7 for Oceanic and Narrow Wetlands, which are intentionally quite confined. (Though, we can always revisit specifics at a later date along with general settings adjustments.)\r\n\r\nI've updated the title and description to reflect the expanded scope."
    },
    {
        "author": {
            "login": "PunkPun"
        },
        "body": "Though I suppose for 7x7 the player could move the mcv sideways to make space"
    },
    {
        "author": {
            "login": "ashleynewson"
        },
        "body": "> When there's not enough room for spawns, maybe it would make sense to start removing features to make space?\r\n\r\nApart from trees, player spawns are the first actors to be placed down on the map. The only features that exist at this point is basically the terrain. Pre-factoring player spawns into the terrain generation is a non-trivial change that I don't think we should invest in any time soon.\r\n\r\n> Though I suppose for 7x7 the player could move the mcv sideways to make space\r\n\r\nYes. It's also worth noting that usually there will be some additional space (that doesn't fit into a perfect square).\r\n\r\nI think 7x7 does the job for now, as far as this PR is concerned. I fully intend for us to have a general round of settings/presets refinement once everything is code complete, like tweaking the number trees and cliffs, amount of water, road constraints, etc. Such changes may result in, for example, a slight expansion of the land mass of oceanic maps, after which the 7x7 exception could simply be removed."
    },
    {
        "author": {
            "login": "PunkPun"
        },
        "body": "[changelog](https://github.com/OpenRA/OpenRA/wiki/Changelog-(bleed)/_compare/4ae67a12ccb3577488ebddc9bccf177dc334dfbb...a39c68b222bb8c17ce49ae162fe1c776b0c79188)"
    }
]