[
    {
        "title": "Generate more elaborate roads"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Updates the random map generator to produce more elaborate roads:\r\n\r\n- Roads extend beyond map bounds.\r\n- Shorter, nonviable road plans are pruned and merged to create longer roads.\r\n- Roads can loop.\r\n\r\nDepends on #21704\r\n"
    },
    {
        "author": {
            "login": "PunkPun"
        },
        "body": "Common crash on winter lakes, winter ocean and other water based maps. Though the crash also appeared in temperate parks `Index was out of range` exception\r\n\r\nFindLowAndHigh|14(List`1 values)\r\n/TilingPath.cs:line 429\r\n/TilingPath.cs:line 480\r\nMapGeneratorToolLogic.cs:line 273\r\n\r\nAnother crash on winter mountain lakes\r\n`Index was outside the bounds of the array`\r\n\r\n/CellLayer.cs:line 82\r\n/RaMapGenerator.cs:line 998\r\n/MapGeneratorToolLogic.cs:line 304\r\n\r\n\r\nGardens generation now looks much better with roads being common. Though roads still don't exactly match man-made as they don't fork. I also find roads beneath orefields a bit weird, maybe some mechanism should try softly nudge ore away from roads?\r\n\r\nRoads appear very seldom on Mountains, when they do appear then the map looks way less barren\r\n\r\nScope creep:\r\n- plains and puddles and lakes improved but still need details. Maybe villages? Some rubble clusters (tiles 98-110, 580-588), desert has lots of rock actors. All maps have utility poles and tank traps\r\n- winter water maps lack tiles (57, 58) and ocean actors (ice01, ice02, ice03, ice04, ice05), IMO these should be added sparingly. The ice tiles are usually added next to beaches\r\n- temperate also has water tiles (57, 58, 500-508)\r\n\r\nclear brush is not removing out of bounds ore\r\n<img width=\"395\" alt=\"Screenshot 2025-01-15 at 17 01 04\" src=\"https://github.com/user-attachments/assets/66170269-5d62-4ef6-bcf6-2729bf44979d\" />\r\n"
    },
    {
        "author": {
            "login": "PunkPun"
        },
        "body": ""
    },
    {
        "author": {
            "login": "PunkPun"
        },
        "body": "LGTM"
    },
    {
        "author": {
            "login": "ashleynewson"
        },
        "body": "A sample of screenshots that compare old and new road layouts (left without patch, right with patch):\r\n\r\n![roads_half](https://github.com/user-attachments/assets/b30278cd-0aa9-4114-8593-75283843be6e)\r\n"
    },
    {
        "author": {
            "login": "ashleynewson"
        },
        "body": "> Common crash on winter lakes, winter ocean and other water based maps. Though the crash also appeared in temperate parks `Index was out of range` exception\r\n\r\nI can reproduce this after setting rotations to 3. Not sure if this was introduced by this PR or if it's just much easier to trigger. I'll investigate, but the solution might come in a separate PR.\r\n\r\n> Another crash on winter mountain lakes\r\n\r\nLooks like another case of me not considering non-trivial rotations, assuming the line numbers are fairly accurate. Will likely be a separate PR as I don't think it's a regression with this change.\r\n\r\nI'm definitely going to need to look into automating the testing as a priority.\r\n\r\n> clear brush is not removing out of bounds ore\r\n\r\nWhat on Earth? How did you manage to get resources there? I can't seem to get it to do that. Is my map generator putting resources out of bounds or just not clearing them from some existing map?\r\n\r\nAm I correct in guessing that this also isn't related to this particular PR?\r\n\r\n> Though roads still don't exactly match man-made as they don't fork\r\n\r\nThis is non-trivial and I don't plan to add proper forking, at least in the short term. It'd likely require adding further tileset data structures.\r\n\r\n> I also find roads beneath orefields a bit weird, maybe some mechanism should try softly nudge ore away from roads?\r\n\r\nI'll consider that for a separate PR.\r\n\r\n> Roads appear very seldom on Mountains\r\n\r\nThis is probably going to be solved in configuration, but I'm trying to keep config changes out of this particular PR.\r\n\r\n> Scope creep\r\n\r\nI think everything else also deserves separate PRs. Perhaps we should open an issue to track all these various improvements and how we prioritise them."
    },
    {
        "author": {
            "login": "ashleynewson"
        },
        "body": "I've fixed the first crash as part of this PR. The second crash I've created #21707 for.\r\n"
    },
    {
        "author": {
            "login": "PunkPun"
        },
        "body": "> What on Earth? How did you manage to get resources there? I can't seem to get it to do that. Is my map generator putting resources out of bounds or just not clearing them from some existing map?\r\n>\r\n> Am I correct in guessing that this also isn't related to this particular PR?\r\n\r\nyes, it exists on the red alert map Imminent Destruction"
    },
    {
        "author": {
            "login": "PunkPun"
        },
        "body": "[changelog](https://github.com/OpenRA/OpenRA/wiki/Changelog-(bleed)/_compare/637413747f2bd5f07876295d70646efde6813bed...ee89c1d6dff68057dee1f0f35edce488fec9346e)"
    }
]