[
    {
        "title": "Fix form field focusing on modal actions in relation managers"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "## Description\r\nOpening a modal from a relation manager causes focus issues with form fields. Some of the symptoms of this bug are:\r\n\r\n1. When any RM modal is opened (header action, table action, filters in a slideover, etc.), text fields remains selected even after clicking out of the field. \r\n2. Typing after clicking out of the field continues to update the field.\r\n3. Since the text field remains selected, trying to trigger buttons, toggles, doesn’t work.\r\n4. If your form is long and scrolls, clicking a button at the bottom will scroll you back to the still selected field.\r\n5. To trigger a button/toggle/radio deck etc. you have to double click quickly, which apparentetly breaks through the focus issue (however only for that click).\r\n\r\nI’ve tracked this down to the `tabindex=\"0\"` on the relation manager when multiple relation managers are used. The tabindex seems to be conflicting with the modal's focusing. \r\n\r\nThis is probably some type of conflict/bug with livewire or alpine.js's focus trap, as `tabindex=\"0\"` has been in core for more than 2 years. But ultimately, I'm unsure as to why `tabindex=\"0\"` is used at all. You can already tab to the RM's buttons/links without it. And Filament doesn't add tabindex to subnavigation groups for example. (That said I'm not an accesibility expert either).\r\n\r\nThis is only an issue when multiple relation managers (or relation manager groups) are on the page (ie when the tab navigation component is displayed). Displaying a single relation manager or single relation manager group doesn't cause this issue as `tabindex=\"0\"` is only added conditionaly when more than one RM are displayed via tabs.\r\n\r\nI did try rolling back filament and livewire as far as I could go and still ran into this issue so not sure what version of filament/livewire/alpine this was introduced in\r\n\r\n## Visual changes\r\nHere's a video of the issue from Filament's demo page, but this issue has also been confirmed in our production app, as well as my plugin demo app.\r\n\r\nhttps://github.com/user-attachments/assets/9992d084-0dc0-4a13-9f4d-548bd53f261e\r\n\r\n\r\n## Functional changes\r\nThis PR just removes `tabindex=\"0\"` from the conditional. \r\n\r\nI've also tested that:\r\n1. The relation manager's actions, links, etc. can still be tabbed to,\r\n2. When opening a modal, the autofocus is still applied to the first element, \r\n3. Focus trapping still works. \r\n4. `->modalAutoFocus(false)` also continues to work\r\n\r\nIf there is a better way to handle this then let me know. \r\n\r\n- [X] Code style has been fixed by running the `composer cs` command.\r\n- [X] Changes have been tested to not break existing functionality.\r\n- [X] Documentation is up-to-date.\r\n\r\nAfter doing some more investigating this should also address and close https://github.com/filamentphp/filament/issues/15289, https://github.com/filamentphp/filament/issues/14999, https://github.com/filamentphp/filament/issues/14913\r\n\r\nThere could be other issues out there, but that's as far as I looked.\r\n"
    },
    {
        "author": {
            "login": "bzy107"
        },
        "body": "The issue with #13661 has also been resolved. Congratulations!"
    },
    {
        "author": {
            "login": "arshaviras"
        },
        "body": "The issue #14999 also resolved, thanks!"
    },
    {
        "author": {
            "login": "gustavocaiano"
        },
        "body": "Can confirm the issue #15289 is resolved with this. Thank you!"
    },
    {
        "author": {
            "login": "danharrin"
        },
        "body": "Thanks!"
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "clicking in a modal with focused element out of the screen makes the modal jump to said element",
                    "body": "### Package\n\nfilament/filament\n\n### Package Version\n\nv3.2.132\n\n### Laravel Version\n\nv11.5.0\n\n### Livewire Version\n\nv3.5.12\n\n### PHP Version\n\nPHP 8.3.13\n\n### Problem description\n\nOn a Modal, if the focused element is not currently on the screen (scrolled out of view) clicking in the modal outside a element triggers a jump to the focused element. \r\nThe same behaviour happens when clicking in a `Toggle Button` , wich makes selecting an option of a toggle impossible if the focused element is out of view.\r\n\r\n![image](https://github.com/user-attachments/assets/96f2259c-806b-47e9-93c2-95af06f17b80)\r\nhere i have selected the Text Input \r\n\r\n![image](https://github.com/user-attachments/assets/f8e8c81a-1a8a-47ec-bcde-cc83743d3994)\r\nHaving scrolled the Focused TextInput out of view, I will not be able to click in this ToggleButton without jumping to the TextInput\r\n\r\n\r\n![chrome-capture-2025-1-8](https://github.com/user-attachments/assets/b27cbe6d-6fbc-4b71-89f6-600ab73da14c)\r\n\n\n### Expected behavior\n\nThe expected behaviour would be either :\r\n- Selecting a option would focus the toggle button, not allowing the modal to jump anywhere.\r\n- making it a option to disable this behaviour of scrollingIntoView when the focused element is not currently seen on screen\n\n### Steps to reproduce\n\n- Go to https://demo.filamentphp.com/shop/products/brands/1/edit \r\n- Click in the CreateAction \"New Product\" of the Products Relation Manager\r\n- Click on the \"Name\" TextInput\r\n- Scroll all the way down (zoom window if needed)\r\n- Click in the modal or outside of the modal (anywhere but a focusable element)\r\n\r\nThe behaviour seen is the same when i click a ToggleButton\n\n### Reproduction repository (issue will be closed if this is not valid)\n\nhttps://github.com/filamentphp/demo\n\n### Relevant log output\n\n_No response_",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": []
                    }
                }
            }
        }
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Toggle Buttons not working if there are more than one Relation Manager",
                    "body": "### Package\r\n\r\nfilament/filament\r\n\r\n### Package Version\r\n\r\n3.2.123\r\n\r\n### Laravel Version\r\n\r\n11\r\n\r\n### Livewire Version\r\n\r\n3\r\n\r\n### PHP Version\r\n\r\n8.3\r\n\r\n### Problem description\r\n\r\nToggle Buttons not working if there are more than one Relation Manager, need to double click, issue is available in official Filament Demo page.\r\n\r\n### Expected behavior\r\n\r\nIt need to to click once not double click\r\n\r\n### Steps to reproduce\r\n\r\nhttps://demo.filamentphp.com/shop/customers/1/edit?activeRelationManager=1\r\ngo to this link and click Edit, on modal form click any of Toggle Button and you can expect an issue.\r\n\r\nHere is the video to show where to reproduce an issue\r\nhttps://stream.new/v/f2plrRWQJINhI7CJCkvsTxZOd01KUNa9YuX011ymRsr00E\r\n\r\n### Reproduction repository (issue will be closed if this is not valid)\r\n\r\nhttps://github.com/arshaviras/demo\r\n\r\n### Relevant log output\r\n\r\n_No response_\r\n\r\n<!-- POLAR PLEDGE BADGE START -->\r\n### Donate 💰 to fund this issue\r\n\r\n- You can donate funding to this issue. We receive the money once the issue is completed & confirmed by you.\r\n- 100% of the funding will be distributed between the Filament core team to run all aspects of the project.\r\n- Thank you in advance for helping us make maintenance sustainable!\r\n\r\n<a href=\"https://polar.sh/filamentphp/filament/issues/14999\">\r\n<picture>\r\n  <source media=\"(prefers-color-scheme: dark)\" srcset=\"https://polar.sh/api/github/filamentphp/filament/issues/14999/pledge.svg?darkmode=1\">\r\n  <img alt=\"Fund with Polar\" src=\"https://polar.sh/api/github/filamentphp/filament/issues/14999/pledge.svg\">\r\n</picture>\r\n</a>\r\n<!-- POLAR PLEDGE BADGE END -->\r\n",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "github-actions"
                                },
                                "body": "Hey @arshaviras! We're sorry to hear that you've hit this issue. 💛\n\n\nHowever, it looks like you forgot to fill in the reproduction repository URL. Can you edit your original post and then we'll look at your issue?\n\nWe need a public GitHub repository which contains a Laravel app with the minimal amount of Filament code to reproduce the problem. **Please do not link to your actual project**, what we need instead is a _minimal_ reproduction in a fresh project without any unnecessary code. This means it doesn't matter if your real project is private / confidential, since we want a link to a separate, isolated reproduction. That would allow us to download it and review your bug much easier, so it can be fixed quicker. Please make sure to include a database seeder with everything we need to set the app up quickly."
                            },
                            {
                                "author": {
                                    "login": "github-actions"
                                },
                                "body": "Thank you for providing reproduction steps! Reopening the issue now."
                            },
                            {
                                "author": {
                                    "login": "bzy107"
                                },
                                "body": "same #13661"
                            },
                            {
                                "author": {
                                    "login": "arshaviras"
                                },
                                "body": "And still not resolved :(("
                            },
                            {
                                "author": {
                                    "login": "arshaviras"
                                },
                                "body": "Very interesting why this bug not resolving such a long time?"
                            },
                            {
                                "author": {
                                    "login": "danharrin"
                                },
                                "body": "Closed by #15430"
                            }
                        ]
                    }
                }
            }
        }
    }
]