[
    {
        "title": "Write generation parameter exif data into output pngs."
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "This adds prompt, negative prompt (if nonempty), seed, sampler and other generation parameters to the output file as a tEXt PNG block, in the same format as AUTOMATIC1111 webui does.\r\n\r\nIn order to keep everything free of external library dependencies, I have somewhat dirtily hacked this into the stb_image_write implementation.\r\n\r\nThings that might still need discussion here:\r\n\r\n- Should this be a command line parameter, or be always-on?\r\n- Would it be better to keep stb_image_write unmodified, use stbi_write_png_to_memory and fudge the tEXt block into that manually in main.cpp?"
    },
    {
        "author": {
            "login": "FSSRepo"
        },
        "body": "I think it should always be included in the image; it doesn't take up space anyway. Whether you want to read it or not will depend on each person, but as a preventive measure, that information should always be included.\r\n\r\n\r\nEdit:\r\nYou should mention this feature in README.md."
    },
    {
        "author": {
            "login": "Green-Sky"
        },
        "body": "> * Would it be better to keep stb_image_write unmodified, use stbi_write_png_to_memory and fudge the tEXt block into that manually in main.cpp?\r\n\r\nThe best case would be to have support upstream (stb), but that is unlikely, to happen soon, even if you open a perfect pr there now :disappointed: .\r\n\r\nI am move of an advocate to keep dependencies clean and work around the limit in the client code, maybe wrap it. I proposed your dirty approach [here](https://github.com/leejet/stable-diffusion.cpp/issues/26#issuecomment-1692115541) too :smile:\r\n\r\n> * Should this be a command line parameter, or be always-on?\r\n\r\nhow about opt-out?"
    },
    {
        "author": {
            "login": "h3ndrik"
        },
        "body": "Sure. Make that always-on or opt-out. Makes little sense to accommodate just the few people who don't want to share their workflow or keep it a secret they did their homework assignment with ChatGPT ;-)"
    },
    {
        "author": {
            "login": "leejet"
        },
        "body": "Great!"
    }
]