[
    {
        "title": "Update Pool from Future to Concurrent::Promises"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "This PR updates SolidQueue::Pool from the deprecated Concurrent::Future to the more \"promising\" (sorry) Concurrent::Promises API.\r\n\r\nRational:\r\nThe Promises based API is documented as preferred over the Future API. Concurrent::Promises are more performant and deadlock resistant -- Good Things(tm) for SolidQueue.\r\n\r\nGiven Concurrent::Promises where released 2018, there is little \"new\" or \"not battle tested\" risk with this change."
    },
    {
        "author": {
            "login": "rosa"
        },
        "body": "Sorry for the delay on this one, @hms! With the holidays and being on-call, I haven't had time to look into this, but I'm going to run it for a bit in our app in production from today, before merging it. "
    },
    {
        "author": {
            "login": "rosa"
        },
        "body": "Oops, sorry @hms, would you mind rebasing this branch on the last `main`? We need the last few changes. "
    },
    {
        "author": {
            "login": "hms"
        },
        "body": "Will do my best to get it done in the 48 hours.  Have some serous family stuff up in the air at the moment. "
    },
    {
        "author": {
            "login": "rosa"
        },
        "body": "Oh no! I'm so sorry to hear that 😔  Please don't worry about this; there's absolutely no rush or anything. Wishing you the best. "
    },
    {
        "author": {
            "login": "hms"
        },
        "body": "@rosa rebased.\r\n\r\n"
    },
    {
        "author": {
            "login": "rosa"
        },
        "body": "Thanks for this, @hms! We've run this for a few days in production without issues, so I'm merging it now. Sorry it took so long and thank you so much for your patience 🙏 "
    },
    {
        "author": {
            "login": "hms"
        },
        "body": "@rosa I really appreciate the communications and help that makes my small contributions possible and the fact that the SQ team is really clear on what they'll consider (or not) and move pretty fast either way."
    }
]