[
    {
        "title": "Delete static recurring tasks before loading them again"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Closes #382 and #420."
    },
    {
        "author": {
            "login": "HLFH"
        },
        "body": "@rosa Hello. I think this desserves a 1.0.3 release :0"
    },
    {
        "author": {
            "login": "rosa"
        },
        "body": "Hey @HLFH, yes! Sorry for the delay, I had been distracted with other work, but I'll ship a new release today. "
    },
    {
        "author": {
            "login": "rosa"
        },
        "body": "Released v1.1.0 with that change, among others 😊 "
    },
    {
        "author": {
            "login": "hallmatt"
        },
        "body": "Thanks @rosa for fixing this! "
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Should delete the old recurring task when the task changed key, or removed",
                    "body": "When the key of a recurring task is changed or the task is removed, should the old task be automatically deleted? This is to ensure that outdated tasks do not continue to run.",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "brettallred"
                                },
                                "body": "I was wondering the same thing. \r\n\r\nWe had a recurring task defined in recurring.yml. After deploy it began running on the regular schedule. \r\nI added three more recurring tasks and removed the original task. However, in the recurring tasks, it is still being executed.\r\n\r\nI'm about to look into the internals now, but I'm assuming that the yml file is being read and creating records in the DB. We probably need to remove the DB entry manually for now but wondering if this is a known issue.\r\n"
                            },
                            {
                                "author": {
                                    "login": "rosa"
                                },
                                "body": "Hey! Are you sure the removed task is still running or just listed in Mission Control but not running? See\r\n- https://github.com/rails/solid_queue/issues/359\r\n- https://github.com/rails/solid_queue/issues/310"
                            },
                            {
                                "author": {
                                    "login": "iuhoay"
                                },
                                "body": "Got it, thanks a lot! @rosa \r\n"
                            },
                            {
                                "author": {
                                    "login": "antulik"
                                },
                                "body": "@rosa I can confirm the removed task is indeed running. "
                            },
                            {
                                "author": {
                                    "login": "rosa"
                                },
                                "body": "@antulik how can you confirm this? Do you have examples of `solid_queue_recurring_executions` records created after you've deleted the task from the config and redeployed, restarting the processes? "
                            },
                            {
                                "author": {
                                    "login": "antulik"
                                },
                                "body": "My apologies, I didn't look deep enough. Execution is not scheduled. To be more specific for a removed cron task:\r\n\r\n- Mission Control -> Recurring tasks -> Next: column **IS** updated \r\n- Mission Control -> Recurring tasks -> Last enqueued: column is **NOT** updated \r\n- Job execution is **NOT** scheduled\r\n\r\n Updated `Next` column threw me off as I expected it to not change as well. TIL"
                            },
                            {
                                "author": {
                                    "login": "rosa"
                                },
                                "body": "Ahhh, makes sense. I'm going to fix this confusion in any case very soon, making sure recurring tasks that are removed from the config are also removed from the DB. "
                            },
                            {
                                "author": {
                                    "login": "rosa"
                                },
                                "body": "Actually going to reopen this one to track that. "
                            }
                        ]
                    }
                }
            }
        }
    }
]