[
    {
        "title": "Error When an Invalid Recurring Task is Configured"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "I took a first crack at resolving #414. I think it's a little bit of a blunt solution.\r\n\r\nResolves #414 "
    },
    {
        "author": {
            "login": "jherdman"
        },
        "body": ""
    },
    {
        "author": {
            "login": "rosa"
        },
        "body": ""
    },
    {
        "author": {
            "login": "jherdman"
        },
        "body": "@rosa take two! I think this is more in line with what you noted above."
    },
    {
        "author": {
            "login": "jherdman"
        },
        "body": ""
    },
    {
        "author": {
            "login": "rosa"
        },
        "body": ""
    },
    {
        "author": {
            "login": "jherdman"
        },
        "body": ""
    },
    {
        "author": {
            "login": "rosa"
        },
        "body": "Wonderful! Thank you so much, @jherdman! 🙏 🙇‍♀️ "
    },
    {
        "author": {
            "login": "rosa"
        },
        "body": "Thanks a lot @jherdman! I was thinking that perhaps this should be part of a more generic configuration validation that runs and raises before starting the supervisor 🤔  "
    },
    {
        "author": {
            "login": "jherdman"
        },
        "body": "Perhaps we need both things? Since the recurring jobs are just DB backed, and have validations, we probably need to report on those validation errors should they occur."
    },
    {
        "author": {
            "login": "rosa"
        },
        "body": "> we probably need to report on those validation errors should they occur.\r\n\r\nRight, I mean doing this as part of that configuration validation that runs before the supervisor starts, instead of waiting until we try to schedule them. "
    },
    {
        "author": {
            "login": "jherdman"
        },
        "body": "I can take a crack at your suggestion unless you have something very specific in mind."
    },
    {
        "author": {
            "login": "rosa"
        },
        "body": "@jherdman thank you! I was just thinking of having the current check [here](https://github.com/rails/solid_queue/blob/be8f367b0603496f2fd9b2a7bc97ca1e8866cbfd/lib/solid_queue/supervisor.rb#L11-L17) expanded to also check if the configuration is valid (`configuration.valid?`), and if not, abort printing the existing errors. I think not having any configured processes could be part of the `configuration.valid?` check. "
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Invalid Recurring Jobs: No Feedback",
                    "body": "I recently added a new entry to `recurring.yml` and mistyped the name of the corresponding job class. I only realized something was askew when I viewed the Recurring Tasks tab in Mission Control.\r\n\r\nI believe there ought to be some feedback when an invalid job class is listed. Perhaps an error or warning. This is something I'm happy to try and implement if it's of interest.",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "rosa"
                                },
                                "body": "Indeed! This is on my personal backlog 😅 I just haven't been able to get to it. I wanted to do a general configuration validation, for recurring tasks but also for the rest of the configuration. If you want to try to implement it, even if it's just for recurring tasks, that'd be awesome! "
                            },
                            {
                                "author": {
                                    "login": "jherdman"
                                },
                                "body": "I'll give it a go! I'll have some time later this week."
                            }
                        ]
                    }
                }
            }
        }
    }
]