[
    {
        "title": "Improve rct battery control"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Hi, 👋\r\n\r\n- Für Netzladen: Setze den Parameter `PowerMngUseGridPowerEnable `auf `true`, damit RCT im Modus `Extern` vom Netz lädt und sich nicht auf die PV-Produktion begrenzt"
    },
    {
        "author": {
            "login": "andig"
        },
        "body": "> Nutze den konstanten Wert 0.97, damit auch dann die Batterie nicht entladen wird, wenn maxsoc kleiner als der aktuelle Batterie-SoC ist\r\n\r\nWarum ist das besser als der vom Anwender konfigurierte MaxSoc? "
    },
    {
        "author": {
            "login": "Maschga"
        },
        "body": "Angenommen, der Anwender will die Batterie maximal bis zu `50%` aus dem Netz laden, setzt also den `maxsoc` auf `50%`. Dann wird im Modus BatteryCharge bis zu `50%` geladen.\r\nWenn aber der Modus BatteryHold ins Spiel kommt und sich die Batterie im Laufe des Tages auf einen Wert größer als `50%` geladen hat - beispielsweise auf `80%` - dann würde die Batterie mit dem aktuellen Code in diesem Modus von `80%` bis auf die `50%` entladen werden. Damit die Batterie nicht entladen wird, muss aber der bei RCT gesetzte `minsoc` über oder gleich dem Batterie-SoC liegen, also am Besten bei dem Maximum, was `97%` wäre.\r\n\r\nIch glaube, dass diese Diskussion auf die Frage hinausläuft, wie `maxsoc` genutzt werden sollte:\r\n1. Bis zum `maxsoc` soll die Batterie aus dem Netz geladen werden\r\n\r\noder\r\n\r\n2. Die Batterie soll generell und nicht nur beim Netzladen maximal bis zum `maxsoc` geladen werden und darüber nicht mehr\r\n\r\nHier kommt es darauf an, wie evcc den Parameter `maxsoc` im Code umgesetzt hat.\r\n\r\nNoch etwas Input: Es gab [hier](https://github.com/evcc-io/evcc/discussions/12377#discussioncomment-12045603) die Frage nach der Funktionalität nur bis zu einem gewissen SoC aus dem Netz zu laden."
    },
    {
        "author": {
            "login": "andig"
        },
        "body": "> Angenommen, der Anwender will die Batterie maximal bis zu 50% aus dem Netz laden, setzt also den maxsoc auf 50%. Dann wird im Modus BatteryCharge bis zu 50% geladen.\r\n\r\nDafür ist der Parameter- da statisch- nicht da. Sondern er definiert die \"gesunde\" obere Ladeschwelle. Typischerweise 95% oder größer."
    },
    {
        "author": {
            "login": "Maschga"
        },
        "body": "Ok, das habe ich reverted. Vielleicht lässt sich das Netzladen bis zu einem bestimmten SoC noch implementieren."
    },
    {
        "author": {
            "login": "TobiasHuber1980"
        },
        "body": "@andig / @Maschga \r\nbekommen wir die Leistung des Wechselrichters noch irgendwie ins Template?\r\nAlso im Template den `0x54829753` mit einem indiviuellem fixen Wert hinterlegen (6000 W / 8000 W / 10000 W) damit dann `power_mng.battery_power_extern` auf den Wert zugreifen kann."
    },
    {
        "author": {
            "login": "andig"
        },
        "body": "Wozu? Wir haben:\r\n\r\n\tcase \"battery\":\r\n\t\treturn m.queryFloat(rct.BatteryPowerW)\r\n"
    }
]