[
    {
        "title": "Allow invalidation of All Visits only"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "### Description:\r\n\r\nThis PR improves and fixes some parts of the `core:invalidate-report-data` command\r\n\r\n* **Allow invalidating `All visits` segment only by providing `--segment=\"\"`**\r\n  This new option will only invalidate the all visits segment\r\n\r\n* **Correctly invalidate all known segments when no segment is provided**\r\n  Before only segments with existing archives were invalidated, causing other segments not to be re archived at all.\r\n\r\n* **Fixed range invalidation of plugin archives**\r\n  While \"normal\" periods were invalidated correctly when a plugin was provided, this was not correctly done for range archives. Instead the all visits archive was invalidated, causing more re archiving than requested.\r\n\r\n* **Improved handling of provided segments**\r\n  When segments were provided that did not exist for one of the provided sites, the command previously failed. Now it will invalidate the segment for all sites where it is available, while skipping it for other sites.\r\n\r\nThe code overall was a restructured and improved. A plenty of new tests for the command should ensure that the correct invalidations are created when command is executed with certain parameters.\r\n\r\nCurrently \"excluded\" from the testing for the command is the handling of existing archives. Those should be marked as invalidated and in certain cases also plugin and segment archives should get invalid, depending on the invalidation request.\r\nBut I didn't want to extend the scope of this change here too much, so we should consider writing some proper tests for `Model::updateArchiveAsInvalidated` method another time.\r\n\r\nfixes #19947 \r\n\r\n### Review\r\n\r\n* [ ] [Functional review done](https://developer.matomo.org/guides/pull-request-reviews#functional-review-done)\r\n* [ ] [Potential edge cases thought about](https://developer.matomo.org/guides/pull-request-reviews#potential-edge-cases-thought-about) (behavior of the code with strange input, with strange internal state or possible interactions with other Matomo subsystems)\r\n* [ ] [Usability review done](https://developer.matomo.org/guides/pull-request-reviews#usability-review-done) (is anything maybe unclear or think about anything that would cause people to reach out to support)\r\n* [ ] [Security review done](https://developer.matomo.org/guides/security-in-piwik#checklist)\r\n* [ ] [Wording review done](https://developer.matomo.org/guides/pull-request-reviews#translations-wording-review-done)\r\n* [ ] [Code review done](https://developer.matomo.org/guides/pull-request-reviews#code-review-done)\r\n* [ ] [Tests were added if useful/possible](https://developer.matomo.org/guides/pull-request-reviews#tests-were-added-if-usefulpossible)\r\n* [ ] [Reviewed for breaking changes](https://developer.matomo.org/guides/pull-request-reviews#reviewed-for-breaking-changes)\r\n* [ ] [Developer changelog updated if needed](https://developer.matomo.org/guides/pull-request-reviews#developer-changelog-updated-if-needed)\r\n* [ ] [Documentation added if needed](https://developer.matomo.org/guides/pull-request-reviews#documentation-added-if-needed)\r\n* [ ] Existing documentation updated if needed\r\n"
    },
    {
        "author": {
            "login": "michalkleiner"
        },
        "body": ""
    },
    {
        "author": {
            "login": "sgiehl"
        },
        "body": ""
    },
    {
        "author": {
            "login": "caddoo"
        },
        "body": "I've tested this locally and can confirm the changes work.\r\n\r\nI appreciate the tidy up you did as well.\r\n\r\nI dislike how much logic we put in our command classes though, but that's not for this PR. Takes a long time to read/understand and I can never be sure if every path is tested."
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Invalidations of reports command should allow to invalidate \"All visits\" only",
                    "body": "Currently, when running `./console core:invalidate-report-data --sites=1 --dates=2022-10-01,2022-10-10`, then all reports for the \"All visits\" segment and all other segments for that site are invalidated. This can cause a huge amount of invalidations which can put a lot of load onto a database and as a result it will take very long to reprocess this data.\r\n\r\nIt would be be great if we could specify something like `--segment=\"\"` and then only the \"All Visits\" segment should be invalidated but not any other segments (unless specific other segments are also specified).\r\n\r\nYou can reproduce this by running `./console core:invalidate-report-data --sites=1 --dates=2022-10-01,2022-10-10` and then you will see invalidations in the `archive_invalidations` table for the `done` archive name and also for all the segments. Expected would be to only see archive invalidations for the `done` archive name.",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "Stan-vw"
                                },
                                "body": "@mattab why is this tagged as 5.1.0, this doesn't sound like extremely high value to a large group of users. Am I missing something?\r\nAlso I see it's been shifted to further milestones quite a few times, can I just shift it to 5.5.0?"
                            },
                            {
                                "author": {
                                    "login": "tsteur"
                                },
                                "body": "@Stan-vw This one is important for us on the Cloud to avoid getting paged when this command is used etc."
                            },
                            {
                                "author": {
                                    "login": "Stan-vw"
                                },
                                "body": "Thanks for explaining Thomas, much appreciated 🙏 "
                            }
                        ]
                    }
                }
            }
        }
    }
]