[
    {
        "title": "[MWB] Fix helper process termination issue in service mode"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "<!-- Enter a brief description/summary of your PR here. What does it fix/what does it change/how was it tested (even manually, if necessary)? -->\r\n## Summary of the Pull Request\r\n\r\nThis PR addresses an issue reported in #30259, where running MWB (Mouse Without Borders) in service mode causes the helper process to remain terminated at various points, resulting in functionalities such as clipboard sharing becoming non-functional.\r\n\r\n<!-- Provide a more detailed description of the PR, other things fixed or any additional comments/features here -->\r\n## Detailed Description of the Pull Request / Additional comments\r\n\r\nWhen MWB is launched in service mode, events such as desktop switches (e.g., UAC prompts) cause the helper process to be killed and subsequently restarted. To restart the helper process within the user's desktop session, the `CreateProcessInInputDesktopSession` method uses APIs such as `WTSQueryUserToken`, which require privileges and the LocalSystem account to function properly.\r\nLink to the relevant code:\r\nhttps://github.com/microsoft/PowerToys/blob/315059fc3be030cdd3b69b846d3f09ac108fffd1/src/modules/MouseWithoutBorders/App/Class/Common.Launch.cs#L88-L202\r\n\r\nHowever, in the scenario where this issue occurs, the main thread is impersonated with user-level permissions, causing these API calls to fail. As a result, the helper process remains terminated, and features like clipboard sharing stop working.\r\n\r\nThrough debugging, I found that the execution permissions of the main thread are impersonated (and not reverted) after a delegate is invoked via `DoSomethingInUIThread` from other threads (e.g., `InputCallback Thread`). The root cause of this behavior is unknown at this time, but I personally feel like it's due to a framework-side issue rather than an implementation issue.\r\n\r\nAfter experimenting with several approaches, I discovered that suppressing the flow of the execution context in the calling thread (using `ExecutionContext.SuppressFlow();`) before invoking `DoSomethingInUIThread` prevents this issue. Given that suppressing the execution context flow from non-main threads does not appear to pose any problems in the current MWB implementation, this PR applies this fix.\r\n\r\n<!-- Describe how you validated the behavior. Add automated tests wherever possible, but list manual validation steps taken as well -->\r\n## Validation Steps Performed\r\n\r\n1. Launch MWB in service mode and move the mouse cursor.\r\n2. Trigger desktop switch events such as displaying a UAC prompt or pressing Ctrl+Alt+Delete.\r\n3. After returning to the original desktop, confirm that the helper process is restarted and that clipboard sharing functionality continues to operate as expected."
    },
    {
        "author": {
            "login": "jaimecbernardo"
        },
        "body": "Thanks for opening this pull request. Very interesting investigation 😄 \r\nI've merged latest main and merged it in, since it caused a build error with a recent refactor.\r\nI've given it a try and it seems to fix it on my Windows 10 machine when going through Ctrl+Alt+Delete. On Windows 11, the Helper process never gets restarted.\r\nOn both Windows 10 and Windows 11, after going through the Lock Screen and having to login again, the Helper process doesn't get restarted.\r\nSo I think this fix is still incomplete. Can you please take a look? Thanks, in advance."
    },
    {
        "author": {
            "login": "jaimecbernardo"
        },
        "body": "LGTM! Much more stable now, too.\r\nDoesn't seem to fix everything wrong with the runner,  but for sure is a start.\r\nI guess adding a comment would be nice on these lines, but I can add that before merging.\r\nThank you for the contribution!"
    },
    {
        "author": {
            "login": "YDKK"
        },
        "body": "@microsoft-github-policy-service agree"
    },
    {
        "author": {
            "login": "YDKK"
        },
        "body": "@jaimecbernardo\r\nThanks for your checking and feedback!\r\n\r\nHmm, that's weird...\r\nI checked again on the branch after merging.\r\nI'm on Windows 11 24H2 and I can confirm that the helper process restarts fine, including through the Lock Screen.\r\n\r\n<details>\r\n<summary>Screen record of the helper process restarting through the Lock Screen</summary>\r\n\r\n![capture](https://github.com/user-attachments/assets/b07f71c7-7632-4382-b3c1-3edec6833e3a)\r\nCan confirm that the helper process was restarted from PID 63468 to 31516.\r\n</details>\r\n\r\nIs there any additional context needed to reproduce?\r\n\r\nThanks,"
    },
    {
        "author": {
            "login": "jaimecbernardo"
        },
        "body": "@YDKK , Gave it another try. After just starting, indeed it's working well, but after a couple of copy pastes from one side to the other and then going to Ctrl-Alt-Del screen, after I cancel that screen Helper doesn't come back.\r\n\r\nTrying to get a more detailed repro here's what I did.\r\nSetup:\r\nPC1 is on Windows 11 and PC2 is on Windows 10 (not sure if relevant). Both are connected through MouseWIthoutBorders, both are Using Service and PowerToys is running as admin.\r\n1- On PC1, I press Ctrl+Alt+Del and then I press Cancel. Helper starts again.\r\n2 - Using PC1's keyboard and mouse, I copy a string from PC1 notepad++ using Ctrl+C and paste it into PC2 notepad++ using Ctrl+V.\r\n3 - On PC1, I press Ctrl+Alt+Del and then I press Cancel. Helper starts.\r\n4 - Using PC1's keyboard and mouse, I copy a string from PC2 notepad++ using Ctrl+C and paste it into PC2 notepad++ using Ctrl+V.\r\n5 - On PC1, I press Ctrl+Alt+Del and then I press Cancel. Helper doesn't start.\r\n\r\nHaving pasted on the PC I press Ctrl+Alt+Del on seems to be causing this issue? 🤔\r\nI've tried again running as service but without PowerToys running as admin and the same happens."
    },
    {
        "author": {
            "login": "YDKK"
        },
        "body": "@jaimecbernardo\r\nThanks for the detailed steps.\r\nI was able to reproduce the problem myself.\r\n\r\nAfter further investigation, I found that the fixes for the threads generated by sockets and clipboard related were missing, so I fixed them in the same way.\r\n\r\nI'm sorry to bother you, but could you check again?"
    },
    {
        "author": {
            "login": "jaimecbernardo"
        },
        "body": "/azp run"
    },
    {
        "author": {
            "login": "azure-pipelines"
        },
        "body": "<samp>\nAzure Pipelines successfully started running 1 pipeline(s).<br>\r\n\n</samp>"
    }
]