[
    {
        "title": "Add an example and type enhancement for TextStreamer"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Added a GenerationConfig option for TextStreamer and included an example in the documentation as part of #394. I used the example you provided directly and tried to adhere to the repository's style as much as possible, but please let me know if anything deviates from the standard."
    },
    {
        "author": {
            "login": "xenova"
        },
        "body": "Thanks! Just some suggestions."
    },
    {
        "author": {
            "login": "seonglae"
        },
        "body": ""
    },
    {
        "author": {
            "login": "xenova"
        },
        "body": "LGTM ✅ Will run tests + build docs & merge soon."
    },
    {
        "author": {
            "login": "HuggingFaceDocBuilderDev"
        },
        "body": "The docs for this PR live [here](https://moon-ci-docs.huggingface.co/docs/transformers.js/pr_1066). All of your documentation changes will be reflected on that endpoint. The docs are available until 30 days after the last update."
    },
    {
        "author": {
            "login": "seonglae"
        },
        "body": "If you don’t mind, I can contribute a `chat-streaming` example to the `/example` folder. Would it be okay to use Vite with Tailwind styling like others (or possibly Shadcn and Next.js), or is there a standard dependency stack for this repository examples?"
    },
    {
        "author": {
            "login": "xenova"
        },
        "body": "That would be much appreciated! However, could you instead contribute it to https://github.com/huggingface/transformers.js-examples? We're in the process of moving all examples to that repository.\r\n\r\nIn terms of stack, feel free to use what you like, but it should contribute to the example you are trying to showcase. For example, for a simple streaming example, I would recommend keeping it as simple as possible (just to highlight the important part; i.e., streaming). That said, it could be useful to see how to pass this information back from a web worker too, so feel free to contribute two examples if you'd like the second one to be more \"fully-featured\". In that case, feel free to use what you feel most comfortable with.\r\n\r\nOne other thing to note is that Next.js introduces another level of complexity since it can be run as a non-static site. Anyway, things to consider - I look forward to the contribution! Thanks!"
    }
]