[
    {
        "title": "Fix regexp handing logic in router. Closes #4204"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "It closes #4204. When regexp matches path not from the beginning, `trim_prefx` validates if path breaks on a path separator in a wrong way.\r\n\r\nHere is a small illustration of the problem:\r\n```\r\npath:       /test/api/123\r\nlayerPath:  /api/123\r\nc:                  ^\r\n```\r\n\r\nafter the fix:\r\n```\r\npath:       /test/api/123\r\nstartIndex:      ^\r\nlayerPath:       /api/123\r\nc:                       ^\r\n```\r\nThis PR fixes his behaviors by testing matched layerPath not from the begging of the path but from the start of the match.\r\n\r\nI have also added a unit test to cover this case.\r\n\r\nExisting logic should not be affected, because in case of a match from the beginning of the path, the `startIndex` variable will be 0 and we will end up an old logic."
    },
    {
        "author": {
            "login": "dougwilson"
        },
        "body": "Thank you for the pull request! I'm not sure if this is a valid use case for the prefix matching function of app.use, though, as it is only supposed to match based on prefix.\r\n\r\nWhat your change here, what is the value of `req.url` within your app.use? I assume it is a mangled value now?"
    },
    {
        "author": {
            "login": "drussilla"
        },
        "body": "Yes, req.url in mangled now. OK, if `app.use` should only match based on prefix, the proper fix would be to add `^` to the regexp if the user didn't specify it (I think the same logic is already implemented somewhere in the code, because if I specify `app.use('/api'...` internally it will be replaced with a regexp `/^\\/api\\/?(?=\\/|$)/i`"
    },
    {
        "author": {
            "login": "drussilla"
        },
        "body": "I have updated this PR (reverted the change and added a unit test to showcase the problem)"
    },
    {
        "author": {
            "login": "dougwilson"
        },
        "body": "Hi @drussilla , sorry for the delay due to current world events 😕 . I just committed a fix (https://github.com/pillarjs/router/commit/16ff25e050243477b44c0e54d01f839d6d018064) to the upstream `router` repo that should fix your issue. The fix will be ported here and does pass the test you provided, and adds the check that really should have always been there. LMK what you think."
    },
    {
        "author": {
            "login": "drussilla"
        },
        "body": "@dougwilson Looks good to me, thanks for the fix and I hope you stay safe and healthy in this crazy time!"
    },
    {
        "author": {
            "login": "dougwilson"
        },
        "body": "Awesome, @drussilla thanks for confirming :) I'll port that change into your PR here (so don't close it unless you really want to) and then we'll get it merged into the upcoming 4.x release (4.18)."
    },
    {
        "author": {
            "login": "dougwilson"
        },
        "body": "Alright, apologies for the delay on that. I have ported the `router` change into the PR here."
    }
]