[
    {
        "title": "Cut down on duplicated CI runs"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "## The Issue\r\n\r\nThe combination of running on all PR and all Push rn means that if a maintainer creates a branch just for a PR, but pushes the branch to `origin` instead of their `upstream` fork, we will run CI twice.\r\n\r\nAn example of the duplicated runs can be seen on this PR:\r\n\r\nhttps://github.com/expressjs/express/pull/5562\r\n\r\nIt ran 48 status checks, which is all 24 in the CI job x2. One for the push event and one for the PR event:\r\n\r\n<img width=\"599\" alt=\"Screenshot 2024-03-25 at 10 20 23 PM\" src=\"https://github.com/expressjs/express/assets/12915163/3a83aac3-04ae-4868-84d1-b607c2e72326\">\r\n\r\nThis is wasteful of CI time, but also likely not intended behavior.\r\n\r\n## The Change\r\n> Note: none of these changes would impact the Windows tests configured through appveyor, the status of which we can tackle elsewhere\r\n\r\n### Only run CI for push events on select branches\r\nWe'll still run on all PRs, this limits only our runs triggered by pushes to branches on `origin`.\r\n\r\nFor selected branches I added:\r\n\r\n* `master`\r\n* `develop` \r\n* `4.x`\r\n* `5.x` \r\n\r\nWe could try a glob for versions instead, but this should be fine until we need that. \r\n\r\n### Skip CI if the change is only to `.md` files\r\n\r\nWe don't lint md currently, so if a PR only changes md, no need to run any of our ci jobs\r\n\r\n### Manage concurrency\r\n\r\nLeverages github actions concurrency group feature to stop any workflows for a given PR or HEAD if a newer trigger is run for that same PR or HEAD. Essentially dedupes, ensuring only the newest changes are fully run.\r\n"
    },
    {
        "author": {
            "login": "wesleytodd"
        },
        "body": "Good change. I had made this in the router repo (not quite as robust as this). It would be really nice if we could consolidate all this. Especially with the scorecard actions being added all over the place this is a lot of stuff to keep in sync."
    },
    {
        "author": {
            "login": "UlisesGascon"
        },
        "body": "LGTM!"
    },
    {
        "author": {
            "login": "jonchurch"
        },
        "body": "Yep, Im happy to see us move fast and take a \"consolidate\" spike once we have an idea of what works"
    },
    {
        "author": {
            "login": "jonchurch"
        },
        "body": "Happy to report this is working well. I haven't tested the concurrency bit, but thanks @Fdawgs for the inspo in https://github.com/fastify/fastify/commit/07f847ed5d1e6cf3942327fcdd982fb891f08133 ❤️ "
    }
]