[
    {
        "title": "Standardize bottom sheets"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Greetings, I wanted to fix the bug where the bottom sheet doesn't display under the navigation bar, but got carried away and kinda moved all bottom sheets to the standard ones from compose material3 lib.\r\n\r\nThis also unintentionally fixed a bunch of other issues:\r\n```\r\n\r\n- Fix a small transparent gap between keyboard and sheet\r\n- Fix needing to swipe very fast to expand the sheet\r\n- Fix sheet sometimes blocking user from exiting\r\n- Fixed a lot of button misalignments\r\n\r\nTag edit scaffold:\r\n- Fix edit tag text box not having a label\r\n- Stop user from creating nameless tags\r\n\r\n\r\nApp edit scaffold:\r\n- Icon selection now opens in a separate sheet and that brings transition animations between the menus.\r\n\r\nIcon edit scaffold:\r\n- Hide search bar when no icon packs installed\r\n- Hide \"Suggestions\" tag when there are no suggestions\r\n\r\nWeather location scaffold:\r\n- The search bar is now an actual search bar instead of a regular text field\r\n\r\nClock widget edit scaffold:\r\n- Icons on the buttons now match the text size\r\n```\r\n\r\nUnfortunately two minor things did not survive this refactor:\r\n- Sheet names. I doubt this is a big issue as the user pretty much always knows why the sheet opened, however it's worth noting.\r\n- Top actions. I moved them to regular buttons where it made sense.\r\n\r\nAlthough I tried to test as thoroughly as I could, I expect there to be something I missed, so all testing efforts will be appreciated."
    },
    {
        "author": {
            "login": "MM2-0"
        },
        "body": ""
    },
    {
        "author": {
            "login": "MM2-0"
        },
        "body": ""
    },
    {
        "author": {
            "login": "MM2-0"
        },
        "body": ""
    },
    {
        "author": {
            "login": "MM2-0"
        },
        "body": ""
    },
    {
        "author": {
            "login": "leekleak"
        },
        "body": ""
    },
    {
        "author": {
            "login": "MM2-0"
        },
        "body": ""
    },
    {
        "author": {
            "login": "leekleak"
        },
        "body": ""
    },
    {
        "author": {
            "login": "MM2-0"
        },
        "body": "Looks good to me. Is there anything you want to change or can this be merged?"
    },
    {
        "author": {
            "login": "leekleak"
        },
        "body": "> Looks good to me. Is there anything you want to change or can this be merged?\n\nCodewise nothing, but perhaps unused strings should be removed?"
    },
    {
        "author": {
            "login": "MM2-0"
        },
        "body": "> Codewise nothing, but perhaps unused strings should be removed?\r\n\r\nGood point, but I'd imagine there are a lot of unused resources and it would be easier to remove them all at once, so maybe we do that later, in a new commit."
    }
]