[
    {
        "title": "Added flags \"Show seconds\" and \"Use theme color\" for clock widgets"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "This PR does several things at once, all related about the clock widget and its styles:\r\n\r\n- Adds two new setting flags for all clock styles:\r\n  - \"Show seconds\", applying only on default size (non-compact), found only on Orbit style, and\r\n  - \"Use theme color\", using Material theme colors as accent, found only on Bold style Material You variant\r\n- Adds all adjustments needed for all existing styles to use these two new flags.\r\n- Removes MDY variant for Bold style: applying Material You variant and \"Use theme color\" settings produces same result on Default variant.\r\n- Adds a new time provider only for the clock, that behaves the same, updating every minute if \"Show seconds\" is disabled for the clock, but updates using a Handler running as close as possible at millisecond zero if needed.\r\n- New clock widget style \"Display\", inspired on clocks with seven-segment LED displays."
    },
    {
        "author": {
            "login": "MM2-0"
        },
        "body": ""
    },
    {
        "author": {
            "login": "strongville"
        },
        "body": ""
    },
    {
        "author": {
            "login": "shtrophic"
        },
        "body": "![2024-01-27_10:06:43](https://github.com/MM2-0/Kvaesitso/assets/47949835/d383108e-b27c-4f10-8865-ddfcd2b140fe)\r\n\r\nYes! The `:` even blink 👍🏼 "
    },
    {
        "author": {
            "login": "strongville"
        },
        "body": "With the new commits, the issue of having icons and other stuff being queried every second, is now solved creating a new time provider (`ProvideClockTime`) that is only used on the `ClockWidget` and `WatchFaceSelector` classes; this provider can update every second or every minute according to the `Show seconds` setting.\r\n\r\nThe previous provider (`ProvideCurrentTime`) was reverted to the previous state (updating values according only to the system broadcast events `ACTION_TIME_TICK` and `ACTION_TIME_CHANGED`, every minute at most) and it's now composed a little bit more deeply into the tree (next to the Scaffolds, the only place in which is currently queried)."
    }
]