[
    {
        "title": "Use Material You Compat on Android 12+ if flag is enabled"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Some customization layers such as One UI or MIUI don't retrieve a meaningful color on wallpaper change (maybe this is just done on manual wallpaper selection, which kinda misses the purpose of automatic theming...), and on previous versions, for example, Android 11, still on One UI, this launcher shows more coherent colors most of the time.\r\n\r\nThis PR suggests a new settings flag under \"Appearance\" to ignore system colors on API 31+ and use same color quantization scheme for Android 8+, technically skipping the conditional that asks system its colors.\r\n\r\nCould close #524 or related if it is merged."
    },
    {
        "author": {
            "login": "strongville"
        },
        "body": "Wit the refactor made for the settings data, integrate this flag onto migration classes no longer makes sense.\r\nThis PR was updated to reflect that."
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "color pallet bug when closing launcher settingd",
                    "body": "Whenever we open launcher settings and change something and then close settings from recent view\r\n\r\nThe whole launcher reverts to previous color pallet .\r\n\r\nBut not the one generated by the launcher\r\n\r\nAnd then I have to change the wallpaper to make it go dynamic again\r\n\r\n\r\n\r\n![Screenshot_2023-08-31-14-37-27-233_de mm20 launcher2 release](https://github.com/MM2-0/Kvaesitso/assets/78704469/e4c5bc25-56a1-405e-8f54-c752e24610d2)\r\n\r\nSee wallpaper color and launcher color",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "MM2-0"
                                },
                                "body": "Can you record a video? I don't quite understand what you mean"
                            },
                            {
                                "author": {
                                    "login": "exstntlmsnthrp"
                                },
                                "body": "@ansarimohammed422 GitHub limits the size of uploads, so you either need to edit the video smaller or reduce the quality so it's smaller. I don't remember, but I believe the limit is 15mb. Maybe that will help you. \n\nAnother option is save the video elsewhere online and just share a link to the video. "
                            },
                            {
                                "author": {
                                    "login": "ansarimohammed422"
                                },
                                "body": "Video:-\r\n\r\nDon't pay attention to icon pack ita another bug\r\n\r\n\r\n\r\nhttps://github.com/MM2-0/Kvaesitso/assets/78704469/aceb7532-8bd7-4b68-b5c1-f9c226a61a19\r\n\r\nSee launcher color before and after I close settings from recents view\r\n\r\nIt fall backs to previous wallpaper color"
                            },
                            {
                                "author": {
                                    "login": "ansarimohammed422"
                                },
                                "body": "Any update on this issue"
                            },
                            {
                                "author": {
                                    "login": "MM2-0"
                                },
                                "body": "Yeah: can't reproduce. Anyone else facing this issue? Btw are you on pre-Android 12 or Android 12+?"
                            },
                            {
                                "author": {
                                    "login": "ansarimohammed422"
                                },
                                "body": "I am on android 13 miui 14"
                            },
                            {
                                "author": {
                                    "login": "ansarimohammed422"
                                },
                                "body": "Once again this bug occurred see this video...\r\n\r\n\r\nhttps://github.com/MM2-0/Kvaesitso/assets/78704469/534e325d-9ddf-4491-8945-85d1e31e1453\r\n\r\n"
                            },
                            {
                                "author": {
                                    "login": "ansarimohammed422"
                                },
                                "body": "Any fixes for this issue"
                            },
                            {
                                "author": {
                                    "login": "strongville"
                                },
                                "body": "Can we use Material You Compat also for versions 12+ in Kvaesitso?\r\n\r\nIt seems that some customization layers such as One UI (in my case) or MIUI (on PO's case) don't retrieve a meaningful color on wallpaper change (just on enabling the option from Settings, so cumbersome...), and on previous versions, for example, Android 11, still on One UI, the color is more coherent."
                            }
                        ]
                    }
                }
            }
        }
    }
]