[
    {
        "title": "Fix: don't treat PH OpeningHours with specified time as `everyDay`"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Quick patch in case you intend to tag a new bugfix release before we possibly migrate parsing opening hours to an external library, as suggested in #860.\r\n"
    },
    {
        "data": {
            "repository": {
                "issue": {
                    "title": "Chore: migrate OSM parsing of opening-hours to external library",
                    "body": "I have come accross some cases where our current parsing of the OSM `opening_hours` tag is not correct. While digging into the issue, I discovered that in the meantime of merging the OSM PR, some new libraries for just that have popped up. One of them is https://github.com/westnordost/osm-opening-hours which is also used in https://github.com/streetcomplete/StreetComplete.\n\nI suggest migrating to that library instead of re-inventing the wheel, since also, our implementation does not cover month- or season-specific opening hours. What do you think?\n\nAlso, would you prefer this change to be a seperate PR or can I just include it in #772?",
                    "state": "CLOSED",
                    "comments": {
                        "nodes": [
                            {
                                "author": {
                                    "login": "MM2-0"
                                },
                                "body": "Feel free. Does that require any changes to the `OpeningSchedule` interface? Or is it just an implementation detail?\r\n\r\n> Also, would you prefer this change to be a seperate PR or can I just include it in https://github.com/MM2-0/Kvaesitso/pull/772?\r\n\r\nI'd prefer it in a separate PR, so that it doesn't block #772 from being merged."
                            },
                            {
                                "author": {
                                    "login": "shtrophic"
                                },
                                "body": "> Does that require any changes to the OpeningSchedule interface?\r\n\r\nProbably not; Creating some `OpeningSchedule` instance from results returned by that library should still be possible. We can also just skip tracking any season- or month specifics since we only show weekly previews; That is, I'd create the `OpeningSchedule` instance based on the library result and the users LocalTime."
                            }
                        ]
                    }
                }
            }
        }
    }
]