[
    {
        "title": "Improve readability of axis numbering; use Hershey font."
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "The axes labels were always hard to read due to their simple '7 segment' shape that easily can be mis-read from different perspectives (e.g is something a 2 or an upside 5 ?)\r\n\r\nThis change uses the Hershey Simplex font commonly used in such applications.\r\n\r\n * Use the Hershey Simplex font to draw the numbers on the axes, replacing the ad-hoc 7-segment font. The Simplex font just uses simple line-segments so is fast to draw and crisp to read (it is commonly used in CAD and plotting applications to emit labels for that reason).\r\n * Provide a text drawing function that with an interface that emits calls with drawing instructions, abstracting away the output device (the text drawing function itself does not need to know about glVertex3D()).\r\n * While at it, include not only numbers but all characters from the Hershey Simplex font, which allows to use this to draw other ASCII-labels as well.\r\n * Use that in the GLView::decodeMarkerValue() to draw the number axis annotations, _vastly_ improving readability of these labels.\r\n\r\nWhile at it, also improve placement of the text\r\n\r\n  * The numbers are now horizontally centered around the corresponding tick on the axis (including the negative axis).\r\n  * Make all numbers readable in the default projection, looking forward on the coordinate system (Y and Z used to be weirdly 'backwards' before).\r\n\r\nHere a before/after\r\n\r\n![before-font](https://github.com/user-attachments/assets/f36cbf7b-c305-4ae1-9825-81936a7a22b1)\r\n\r\n![after-font](https://github.com/user-attachments/assets/1b30cb34-2349-4750-9f89-3b4b56c78a1b)\r\n"
    },
    {
        "author": {
            "login": "t-paul"
        },
        "body": "Looks great. With the ongoing refactoring of the OpenGL code, I hope @kintel will find some time to have a look for merging.\r\n\r\nI just have 2 questions\r\n\r\n1) Regarding licensing, as Linux distributions usually require a clear specification of what file is covered under which license: Do you see both new files fully covered by the Hershey License?\r\n\r\n2) The comment says \"Roman Simplex font\", which one is that? `rowmans.jhf`?"
    },
    {
        "author": {
            "login": "kintel"
        },
        "body": ""
    },
    {
        "author": {
            "login": "hzeller"
        },
        "body": "Also numbers with additional characters such as exponent `1e+06` or with decimal point `0.16` look much better with this change\r\n\r\n|     Before  |  After |\r\n|---------------|-----------|\r\n|![font-1e6-old](https://github.com/user-attachments/assets/b82b33bd-7a3f-46d6-9710-92d49bd0f0cf) | ![font-1e6-new](https://github.com/user-attachments/assets/4a4b771a-35c2-4b89-a992-043b15984c6e)\r\n|![font-012-old](https://github.com/user-attachments/assets/340b206a-cfd8-42d7-9c0d-9acfcb010f5e) |![font-0 12-new](https://github.com/user-attachments/assets/48ce0291-56fa-4649-918b-4614193937a0)\r\n"
    },
    {
        "author": {
            "login": "tpimh"
        },
        "body": "Looks very nice, can't wait for this to be merged!"
    },
    {
        "author": {
            "login": "hzeller"
        },
        "body": "The code `hershey.{cc,h}` is covered by GPL (whichever Version is preferred), written by me (in fact I wrote it a couple of years ago in my [BeagleG project](https://github.com/hzeller/beagleg/blob/main/src/hershey.cc) - so here it is only with minor formatting changes)\r\n\r\nThe font is  just the data in the array and the comment above the array satisfies the license requirements to attribute Hershey.\r\n\r\nWhich of the Hershey Filename: don't know, I converted that a long time ago and I don't know if  there was a filename associated with it. Roman Simplex is sufficient to characterize it (there are also Japanese as opposed to Roman and there are Duplex and Gothic which use more strokes.) I might have gotten the original data from https://paulbourke.net/dataformats/hershey/ which I then converted into the current form."
    },
    {
        "author": {
            "login": "kintel"
        },
        "body": "I'll review this.\r\nEventually we want to phase out immediate mode OpenGL (glBegin, glEnd, glVertex3d etc.), but this patch doesn't make it any worse, so we can probably merge it after review."
    },
    {
        "author": {
            "login": "kintel"
        },
        "body": "Somewhat surprisingly, tests didn't fail, but I guess our \"1-pixel-erode\" to account for GPU differences kind of erases any 1-pixel fonts as well ;)\r\n"
    }
]