[
    {
        "title": "VeriCite plugin integration into Assignments, Gradebook, and Speedgrader"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "I have added VeriCite to the list of \"/plugins\". This is how you enable VeriCite for your account. Once enabled, an option will show up in the assignment settings for \"inline\" or \"upload\" assignment types. This plugin uses all of the existing turnitin data structures in the tables as requested. The only additional DDL required is a flag on the assignments table in order to differentiate which service is enabled:\n\nalter table assignments ADD vericite_enabled boolean;\n\nHere is a video of the plugin in action:\n\nhttps://youtu.be/ttdFkyR1VTM?t=36s (note that it now uses the plugin configuration instead of the account settings shown in the video)\n"
    },
    {
        "author": {
            "login": "ktgeek"
        },
        "body": "Besides the comments left in the files, here's a few overall issues we'd like toes addressed:\n- We'd like to see the gem packaged seperately and publicly and refer to that via the gemfile.  Would nessessitate a change to Gemfile.d/app.rb.  Also note: As a dependency, we didn't code review the gem.)\n-  style conventions in new code should follow the ruby conventions.  For example, camel case variables in submission.check_verivite_status should be fixed.  (Not the only area, just one example.)\n\nFYI, spec files weren't code reviewed deeply because the amount of implementation changes suggested would nessessitate changes to the specs.\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "Thanks for the code review! I will spend some time trying to go through the feedback and seeing what can be done.\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek \nI have made the changes you requested in your code review. I will work on making the VeriCite gem packaged separately, but I figured that you could start going over the changes on the other code while I work on packaging VeriCite as a gem.\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek @claydiffrient \nI have made all of the recommended changes and have completed making VeriCite a separately packaged GEM. Please continue with the review process!\n"
    },
    {
        "author": {
            "login": "claydiffrient"
        },
        "body": "@baholladay Would you mind squashing the 4 commits down to one?  It makes it much easier to run this through out internal build/review process (and keeps me from having to guess on conflicts 😄 )\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@claydiffrient \n I have squashed all commits into one. I originally included the commit history in case you wanted to see the revisions I made based on the code review.\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "I have made the blabel and snake_case changes. \n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek @cmatheson  I've made your requested changes. If you want me to make the VeriCite API call more explicitly stated, please review the attached patch on this comment. It adds a \"lookup_api\" parameter, which determines whether or not the \"vericite_data\" function will look up data in the VeriCite API or just rely on the Canvas DB. If you want this, I can include it on this PR. Please let me know.\n\n[vericite_patch.txt](https://github.com/instructure/canvas-lms/files/407717/vericite_patch.txt)\n"
    },
    {
        "author": {
            "login": "ktgeek"
        },
        "body": "@baholladay Sorry for the delay in reply. With that last patch.txt file, we're about ready to accept it and move it into QA.  If would be helpful if you could make a new pull request with all the changes based on the latest master.\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek I've applied that last vericite_patch.txt file and rebased this PR. I also QA'ed one more time to make sure I didn't break anything in the rebase. This PR is ready for you and your team!\n"
    },
    {
        "author": {
            "login": "ktgeek"
        },
        "body": "Hey @baholladay!  During the move into QA we found a bunch of unit tests and selenium tests that weren't passing.  I've pulled out the relevant parts of the stack trace as well as the error that was recorded for you to address.\n\n> spec/selenium/gradebook/gradebook2/gradebook2_turnitin_spec.rb:34\n> Selenium::WebDriver::Error::NoSuchElementError: Selenium::WebDriver::Error::NoSuchElementError\n> \n> /mnt/canvas/spec/selenium/assignments/assignments_turn_it_in_spec.rb:21:in `change_turnitin_settings'\n> /mnt/canvas/spec/selenium/assignments/assignments_turn_it_in_spec.rb:63:in`block (3 levels) in <top (required)>'\n> Selenium::WebDriver::Error::ElementNotVisibleError: Element is not currently visible and so may not be interacted with\n> \n> /mnt/canvas/spec/selenium/assignments/assignments_turn_it_in_spec.rb:21:in `change_turnitin_settings'\n> /mnt/canvas/spec/selenium/assignments/assignments_turn_it_in_spec.rb:80:in`block (2 levels) in <top (required)>'\n> Selenium::WebDriver::Error::ElementNotVisibleError: Element is not currently visible and so may not be interacted with\n> \n> spec/selenium/speedgrader_teacher_submission_spec.rb:226\n> Selenium::WebDriver::Error::NoSuchElementError: Unable to locate element: {\"method\":\"css selector\",\"selector\":\"#grade_container .submission_pending\"}\n> \n> spec/selenium/speedgrader_teacher_submission_spec.rb:240\n> Selenium::WebDriver::Error::NoSuchElementError: Unable to locate element: {\"method\":\"css selector\",\"selector\":\"#grade_container .turnitin_similarity_score\"}\n> \n> spec/selenium/speedgrader_teacher_submission_spec.rb:287\n> Selenium::WebDriver::Error::NoSuchElementError: Unable to locate element: {\"method\":\"css selector\",\"selector\":\"#grade_container .submission_error\"}\n> \n> spec/selenium/speedgrader_teacher_submission_spec.rb:250\n> Selenium::WebDriver::Error::NoSuchElementError: Unable to locate element: {\"method\":\"css selector\",\"selector\":\"#grade_container .submission_error\"}\n> \n> spec/apis/v1/submissions_api_spec.rb:1220\n> RSpec::Expectations::ExpectationNotMetError: expected #has_key?(\"turnitin_data\") to return true, got false\n\nI rebased against master before I confirmed the failing tests, so the pull request we're working on has a parent of 19bf7c867f57070b5ec81424452f129e75b82fc4\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek Is there a way we can get together virtually and talk about these errors? You can contact me by emailing support@vericite.com and we can try to set something up.\n\nIs there documentation on how to run the selenium and unit tests? For example, I looked at the first error:\n\nspec/selenium/gradebook/gradebook2/gradebook2_turnitin_spec.rb:34\nSelenium::WebDriver::Error::NoSuchElementError: \nSelenium::WebDriver::Error::NoSuchElementError\n\nThat line is \"icons = ffj('.gradebook-cell-turnitin')\". However, looking at the attached screenshot, you can see that the plagiarism icons have that .gradebook-cell-turnitin class so I don't know why this would fail unless it just didn't work before or a previous test didn't work causing this part to not work.\n\n<img width=\"664\" alt=\"screen shot 2016-08-24 at 10 39 50 am\" src=\"https://cloud.githubusercontent.com/assets/345790/17934976/d233f782-69e7-11e6-947d-0a40002177ed.png\">\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek I've updated one spec that may have caused the cascade of the other errors. Can you update and retry? I'll look into how to run these tests myself as well. Please contact me if you can so that we can be more efficient.\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek I've updated the PR to include the db migration script for VeriCite and the additional changes needed to make the selenium and unit tests to run for TII. Thanks for all of your help!\n"
    },
    {
        "author": {
            "login": "ktgeek"
        },
        "body": "Cut off one head of the hydra, two more grow in its place.  I'll be e-mailing you directly, @baholladay, looks like another pass is needed.\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "Thanks @ktgeek!\n\nKeith,\n\nI spent all this morning working on the unit tests and was able to figure out the issue. I have ran all of the following test successfully,\n\nbundle _1.11.2_ exec rspec spec/selenium/client_apps/canvas_quizzes_spec.rb\nbundle _1.11.2_ exec rspec spec/selenium/conversations/conversations_inbox_opt_out_spec.rb\nbundle _1.11.2_ exec rspec spec/apis/v1/assignments_api_spec.rb\nbundle _1.11.2_ exec rspec spec/selenium/quizzes/quizzes_log_auditing_spec.rb\nbundle _1.11.2_ exec rspec spec/selenium/speedgrader_teacher_spec.rb\nbundle _1.11.2_ exec rspec spec/apis/v1/stream_items_api_spec.rb\nbundle _1.11.2_ exec rspec spec/apis/v1/assignments_api_spec.rb\nbundle _1.11.2_ exec rspec spec/apis/v1/gradebook_history_spec.rb\nbundle _1.11.2_ exec rspec spec/apis/v1/submissions_api_spec.rb\nbundle _1.11.2_ exec rspec spec/lib/turnitin\nbundle _1.11.2_ exec rspec spec/lib/turnitin_spec.rb\nbundle _1.11.2_ exec rspec spec/selenium/assignments/assignments_turn_it_in_spec.rb\nbundle _1.11.2_ exec rspec spec/selenium/gradebook/gradebook2/gradebook2_turnitin_spec.rb\n\nHowever, there is one test that I do not believe is connected to my patch that keeps failing:\n\nbundle _1.11.2_ exec rspec spec/selenium/differentiated_assignments/da_assignments_spec.rb\n\nrspec ./spec/selenium/differentiated_assignments/da_assignments_spec.rb:125 # interaction with differentiated assignments Observer with student Assignment Show page and Submission page should allow previous submissions to be accessed on an inaccessible assignment\nrspec ./spec/selenium/differentiated_assignments/da_assignments_spec.rb:51 # interaction with differentiated assignments Student Assignment Show page and Submission page should allow previous submissions to be accessed on an inaccessible assignment\n\nI checked out a clean copy of Instructure's master and rebuilt/compiled everything and I still get those two errors. Can you see if you are able to reproduce this as well with both a clean master checkout (latest) as well as on my VeriCite plugin branch?\n"
    },
    {
        "author": {
            "login": "ktgeek"
        },
        "body": "Hey Bryan, it looks like the last of the unit test that wasn't passing was in our javascript side.  It looks like the test as written didn't match the code that was produced.  I'm guessing it was a cut and paste error.  I had the test match the code, and its now passed.  I've attached the tiny diff\n\n[last.diff.zip](https://github.com/instructure/canvas-lms/files/457898/last.diff.zip)\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek Thanks! I've applied your patch to this PR. I believe all of the unit tests now pass! Thanks for your help on that.\n"
    },
    {
        "author": {
            "login": "ktgeek"
        },
        "body": "@baholladay, since we last talked in e-mail a day or two ago, have you pushed a new version of the pull request?\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek I made the changes to address the QA bugs and pushed them in this PR. I was not sure whether you wanted me to address the initial score concerns by adding an option to wait (or even if it was decided) and whether it would be part of this PR iteration or if it would be a 2nd PR iteration. I can meet with you if you want to discuss it.\n"
    },
    {
        "author": {
            "login": "ktgeek"
        },
        "body": "I don't think we need to meet.  I agree with doing the option to wait\" as a second PR, this one is getting pretty big and going into an interactive period would be good.  We can hold off deploy on this side and, ideally, have the new PR built off this one.\n\nActually, maybe \"option to not-wait\" as I think we'd prefer waiting to be the default.\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek  \n\n> I agree with doing the option to wait\" as a second PR\n\nSounds good. We'll have to add a flag in our score API result, but its a simple change that won't break our existing LMS integrations and is a feature we could release to the other LMSs as well :)\n\n> maybe \"option to not-wait\" as I think we'd prefer waiting to be the default\n> Making it the default sounds good. I can get this work started for the next PR.\n\nPlease have your QA team re-test the PR since I made those fixes to the bugs they found. It was the provider flag not being set in all cases, so make sure they test with a fresh database.\n"
    },
    {
        "author": {
            "login": "ktgeek"
        },
        "body": "I just repulled this into our local system and its not reporting any changes.  Can you double checked you pushed those up?\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "I double checked this PR code and see the changes I made. I also see the history of my commit has moved to between my comment 7 days ago and this one (cbf24d8), which GitHub does when you force update a commit. You can do an easy check by looking at line 11 in app/views/jst/assignments/VeriCiteSettingsDialog.handlebars I added \"style=\"min-width: 18em;\"\" to address the concerns for the VC options dropdown not being wide enough:\n\n<select id=\"settings_originality_report_visibility\" style=\"min-width: 18em;\n"
    },
    {
        "author": {
            "login": "ktgeek"
        },
        "body": "Hmm... Okay, something is wonky here.  Looking at https://github.com/baholladay/canvas-lms/commits/vericite-master , which this pull request is against, the last update seems to be 9/9, which is the last time I pulled, and its identical to my pull from that day.  I'm not sure where/why I'm not seeing your update.\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek My last update was on Sept 9th which covered the bugs discovered during QA. I haven't started work on the \"option to not-wait\" since I thought that will be part of a different PR. What changes are you looking for?\n"
    },
    {
        "author": {
            "login": "ktgeek"
        },
        "body": "Oh sorry, I was confused.  For some reason I thought you had added more QA findings after 9/9.\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek Any update on the QA status? I have the code ready for the next PR which includes a configurable option to not show preliminary scores (default is to wait).\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek I have updated the PR based on the new round of QA feedback. It is ready for another round of QA. Thanks!\n"
    },
    {
        "author": {
            "login": "ccutrer"
        },
        "body": "@baholladay: I'm currently checking some Ruby 2.4 compatibility issues, and one of the things is that json must be updated to 2.0. Your vericite_api gem is currently requiring `(~> 1.4, >= 1.4.6)`. Would it be possible to update that to just `(>= 1.4.6)`?\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ccutrer  I get a few warnings when I build the gem, but if you are ok with this, then I can proceed with updating the gem:\n\ngem build vericite_api.gemspec \nWARNING:  description and summary are identical\nWARNING:  open-ended dependency on json (>= 1.4.6) is not recommended\n  if json is semantically versioned, use:\n    add_runtime_dependency 'json', '~> 1.4', '>= 1.4.6'\n"
    },
    {
        "author": {
            "login": "ccutrer"
        },
        "body": "yup, that's what we're looking for. if you're really concerned about the warning, you could add '<3'. and of course, if your gem has any internal tests, they should pass with the json 2.0.2 gem\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ccutrer I've published an updated gem: vericite_api v1.2.0\n\nHere is a patch to update it:\n\n```\ndiff --git a/Gemfile.d/app.rb b/Gemfile.d/app.rb\nindex 5b9963d..8cccd9c 100644\n--- a/Gemfile.d/app.rb\n+++ b/Gemfile.d/app.rb\n@@ -143,6 +143,6 @@ gem 'multipart', path: 'gems/multipart'\n gem 'paginated_collection', path: 'gems/paginated_collection'\n gem 'stringify_ids', path: 'gems/stringify_ids'\n gem 'twitter', path: 'gems/twitter'\n-gem 'vericite_api', '1.1.0'\n+gem 'vericite_api', '1.2.0'\n gem 'utf8_cleaner', path: 'gems/utf8_cleaner'\n gem 'workflow', path: 'gems/workflow'\n```\n"
    }
]