[
    {
        "title": "Show VeriCite reports for Peer Review assessments"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "When an assignment has both VeriCite and Peer Review enabled, allow reviewers to see the VeriCite reports.\r\n\r\nTest Plan:\r\n1) Enable VeriCite in the account plugins page\r\n2) Create an assignment with both VeriCite and Peer Review enabled\r\n3) Submit as multiple students\r\n4) Assign peer reviews (manually or automaticaly)\r\n5) As a student, view a peer review and make sure the VeriCite report is available\r\n6) Modify the assignment's VeriCite advanced settings and set Students Can See the Originality Report to \"none\"\r\n7) Make sure the students can not see the VeriCite reports in the Peer Review page"
    },
    {
        "author": {
            "login": "ktgeek"
        },
        "body": "Besides the comments inline, would it be possible to add a unit test that exercises this behavior?"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": ""
    },
    {
        "author": {
            "login": "ktgeek"
        },
        "body": "Pulled in for review"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek I've updated the PR with your suggestions"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "I'll see if I can get a unit test included"
    },
    {
        "author": {
            "login": "ktgeek"
        },
        "body": "QA kicked this back with: \"Students reviewing a submission don't see any vericite icons.\"\r\n"
    },
    {
        "author": {
            "login": "baholladay"
        },
        "body": "@ktgeek As I was working on the unit test, I discovered why the QA found what they did. I didn't have a large enough test data set for the peer review. I've updated the logic in \"user_can_peer_review_plagiarism\" and everything should be working now. Also, I've added a selenium unit test."
    }
]