[
    {
        "title": "fix: Use statefull analyzers in generator"
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Uses stateful analyzers to analyze both endpoints and model files in the generator.\r\n\r\nThis PR is a preparation for supporting endpoint and model files located anywhere in the project that is tracked here  https://github.com/serverpod/serverpod/issues/964\r\n\r\nThis PR also introduces additional filtering on the watched files to only trigger a regeneration when either an endpoint or a model file is updated. This will be a necessary change once we listen to all files in the project directory to prevent unnecessary regenerations for other file changes.\r\n\r\nA small delay was added to generate files so that multiple changes are batched together. For example, when a file is moved from one folder to another, this creates an `add` and a `remove` event, which could introduce an invalid state if they are processed separately. We already have tests that validate this in the e2e generate watch tests.\r\n\r\n## Pre-launch Checklist\r\n\r\n- [x] I read the [Contribute](https://docs.serverpod.dev/contribute) page and followed the process outlined there for submitting PRs.\r\n- [x] This update contains only one single feature or bug fix and nothing else. (If you are submitting multiple fixes, please make multiple PRs.)\r\n- [x] I read and followed the [Dart Style Guide](https://dart.dev/guides/language/effective-dart/style) and formatted the code with [dart format](https://dart.dev/tools/dart-format).\r\n- [x] I listed at least one issue that this PR fixes in the description above.\r\n- [x] I updated/added relevant documentation (doc comments with `///`), and made sure that the documentation follows the same style as other Serverpod documentation. I checked spelling and grammar.\r\n- [x] I added new tests to check the change I am making.\r\n- [x] All existing and new tests are passing.\r\n- [x] Any breaking changes are documented below.\r\n\r\nIf you need help, consider asking for advice on the [discussion board](https://github.com/serverpod/serverpod/discussions).\r\n\r\n## Breaking changes\r\n\r\nNone - the changes in this PR should preserve the current generated behavior."
    },
    {
        "author": {
            "login": "Isakdl"
        },
        "body": "LGTM, but I have added some nit suggestions!"
    },
    {
        "author": {
            "login": "SandPod"
        },
        "body": ""
    }
]