[
    {
        "title": "fix: Only assign project model definitions to project models."
    },
    {
        "author": {
            "login": "PR Description"
        },
        "body": "Implements a stricter check to ensure that the projectModelDefinition field is only assigned to a model that is part of the project.\r\n\r\nIf this check is missing, an invalid reference might be generated. This could happened if there was a class name collision with a Serverpod model.\r\n\r\nOne such example was a project with a `Filter` model, which was used as a field in another model. When the project was loaded, the Serverpod definitions of the `filter`model were loaded first, so it was assigned as the 'projectModelDefinition` value.\r\n\r\nThis fix should also be applied to the `Stable-2.2` branch.\r\n\r\nCreated an issue to fix this \"potential\" issue in the other places as well: https://github.com/serverpod/serverpod/issues/3019\r\n\r\n## Pre-launch Checklist\r\n\r\n- [x] I read the [Contribute](https://docs.serverpod.dev/contribute) page and followed the process outlined there for submitting PRs.\r\n- [x] This update contains only one single feature or bug fix and nothing else. (If you are submitting multiple fixes, please make multiple PRs.)\r\n- [x] I read and followed the [Dart Style Guide](https://dart.dev/guides/language/effective-dart/style) and formatted the code with [dart format](https://dart.dev/tools/dart-format).\r\n- [x] I listed at least one issue that this PR fixes in the description above.\r\n- [x] I updated/added relevant documentation (doc comments with `///`), and made sure that the documentation follows the same style as other Serverpod documentation. I checked spelling and grammar.\r\n- [x] I added new tests to check the change I am making.\r\n- [x] All existing and new tests are passing.\r\n- [x] Any breaking changes are documented below.\r\n\r\nIf you need help, consider asking for advice on the [discussion board](https://github.com/serverpod/serverpod/discussions).\r\n\r\n## Breaking changes\r\n\r\nNone - Simple bugfix."
    },
    {
        "author": {
            "login": "hampuslavin"
        },
        "body": ""
    },
    {
        "author": {
            "login": "SandPod"
        },
        "body": ""
    }
]